#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserTag

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DiscoveryBrowserUI_structs.hpp"
#include "DiscoveryBrowserUI_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass ActivityBrowserTag.ActivityBrowserTag_C
// 0x0028 (0x0298 - 0x0270)
class UActivityBrowserTag_C final : public UFortActivityBrowserTag
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               HeightSB;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_EpicContentIcon;                             // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PlayerIcon;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          TagContainer;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ActivityBrowserTag(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void OnTagUpdated();
	void Construct();
	void SetTextColorFromMaterialInstance();
	void SetDefaultStyling();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ActivityBrowserTag_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActivityBrowserTag_C")
	}
	static class UActivityBrowserTag_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityBrowserTag_C>();
	}
};
DUMPER7_ASSERTS_UActivityBrowserTag_C;

SDK_NAMESPACE_END
