#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserLobbyTileButton

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function ActivityBrowserLobbyTileButton.ActivityBrowserLobbyTileButton_C.ExecuteUbergraph_ActivityBrowserLobbyTileButton
// 0x0020 (0x0020 - 0x0000)
struct ActivityBrowserLobbyTileButton_C_ExecuteUbergraph_ActivityBrowserLobbyTileButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ActivityBrowserLobbyTileButton_C_ExecuteUbergraph_ActivityBrowserLobbyTileButton;

// Function ActivityBrowserLobbyTileButton.ActivityBrowserLobbyTileButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserLobbyTileButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ActivityBrowserLobbyTileButton_C_PreConstruct;

// Function ActivityBrowserLobbyTileButton.ActivityBrowserLobbyTileButton_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct ActivityBrowserLobbyTileButton_C_SetText final
{
public:
	class FText                                   GameModeName;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_ActivityBrowserLobbyTileButton_C_SetText;

// Function ActivityBrowserLobbyTileButton.ActivityBrowserLobbyTileButton_C.OnSelectedMatchmaking
// 0x0008 (0x0008 - 0x0000)
struct ActivityBrowserLobbyTileButton_C_OnSelectedMatchmaking final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ActivityBrowserLobbyTileButton_C_OnSelectedMatchmaking;

// Function ActivityBrowserLobbyTileButton.ActivityBrowserLobbyTileButton_C.OnUnSelectedMatchmakingCanceled
// 0x0008 (0x0008 - 0x0000)
struct ActivityBrowserLobbyTileButton_C_OnUnSelectedMatchmakingCanceled final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ActivityBrowserLobbyTileButton_C_OnUnSelectedMatchmakingCanceled;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
