#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLobby_S17_SeasonalResources

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass AthenaLobby_S17_SeasonalResources.AthenaLobby_S17_SeasonalResources_C
// 0x0030 (0x02D8 - 0x02A8)
class UAthenaLobby_S17_SeasonalResources_C final : public UFortGlobalSeasonResourceWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAthenaGlobalCashHorizontal_C*          AthenaGlobalCashHorizontal;                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMoreInfo_Ressources_Button_C*          MoreInfo_Ressources_Button_67;                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMoreInfo_Ressources_MobileButton_C*    MoreInfo_Ressources_MobileButton_19;               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnStylePointsRewardsSet(const int32 Rewards);
	void OnBattleStarRewardsSet(const int32 Rewards);
	void BndEvt__MoreInfo_Ressources_Button_67_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__MoreInfo_Ressources_MobileButton_19_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_AthenaLobby_S17_SeasonalResources(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AthenaLobby_S17_SeasonalResources_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaLobby_S17_SeasonalResources_C")
	}
	static class UAthenaLobby_S17_SeasonalResources_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLobby_S17_SeasonalResources_C>();
	}
};
DUMPER7_ASSERTS_UAthenaLobby_S17_SeasonalResources_C;

SDK_NAMESPACE_END
