#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BacchusItemShopScreen

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BacchusItemShopScreen.BacchusItemShopScreen_C.ExecuteUbergraph_BacchusItemShopScreen
// 0x0010 (0x0010 - 0x0000)
struct BacchusItemShopScreen_C_ExecuteUbergraph_BacchusItemShopScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEmpty;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BacchusItemShopScreen_C_ExecuteUbergraph_BacchusItemShopScreen;

// Function BacchusItemShopScreen.BacchusItemShopScreen_C.OnSectionsEstablished
// 0x0001 (0x0001 - 0x0000)
struct BacchusItemShopScreen_C_OnSectionsEstablished final
{
public:
	bool                                          bEmpty;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BacchusItemShopScreen_C_OnSectionsEstablished;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
