#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassRewardOverviewS17

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BattlePassRewardOverviewS17.BattlePassRewardOverviewS17_C.ExecuteUbergraph_BattlePassRewardOverviewS17
// 0x0088 (0x0088 - 0x0000)
struct BattlePassRewardOverviewS17_C_ExecuteUbergraph_BattlePassRewardOverviewS17 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERewardPageType                               K2Node_Event_InRewardPageType;                     // 0x0004(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPageNavigator_C*                       K2Node_CustomEvent_PageNavigator;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PageNumber;                           // 0x0018(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_Event_InputType;                            // 0x0030(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0038(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0058(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0070(0x0018)()
};
DUMPER7_ASSERTS_BattlePassRewardOverviewS17_C_ExecuteUbergraph_BattlePassRewardOverviewS17;

// Function BattlePassRewardOverviewS17.BattlePassRewardOverviewS17_C.OnInitForPageType
// 0x0001 (0x0001 - 0x0000)
struct BattlePassRewardOverviewS17_C_OnInitForPageType final
{
public:
	ERewardPageType                               InRewardPageType;                                  // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BattlePassRewardOverviewS17_C_OnInitForPageType;

// Function BattlePassRewardOverviewS17.BattlePassRewardOverviewS17_C.OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct BattlePassRewardOverviewS17_C_OnInputMethodChanged final
{
public:
	ECommonInputType                              InputType;                                         // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BattlePassRewardOverviewS17_C_OnInputMethodChanged;

// Function BattlePassRewardOverviewS17.BattlePassRewardOverviewS17_C.OnPageChanged
// 0x0004 (0x0004 - 0x0000)
struct BattlePassRewardOverviewS17_C_OnPageChanged final
{
public:
	int32                                         PageNumber;                                        // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BattlePassRewardOverviewS17_C_OnPageChanged;

// Function BattlePassRewardOverviewS17.BattlePassRewardOverviewS17_C.PageNavigator_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BattlePassRewardOverviewS17_C_PageNavigator_Event_0 final
{
public:
	class UPageNavigator_C*                       PageNavigator_0;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BattlePassRewardOverviewS17_C_PageNavigator_Event_0;

// Function BattlePassRewardOverviewS17.BattlePassRewardOverviewS17_C.SequenceEvent__ENTRYPOINTBattlePassRewardOverviewS17_0
// 0x0008 (0x0008 - 0x0000)
struct BattlePassRewardOverviewS17_C_SequenceEvent__ENTRYPOINTBattlePassRewardOverviewS17_0 final
{
public:
	class UPageNavigator_C*                       PageNavigator_0;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BattlePassRewardOverviewS17_C_SequenceEvent__ENTRYPOINTBattlePassRewardOverviewS17_0;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
