#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BodyguardRuntime

#include "Basic.hpp"

#include "BodyguardRuntime_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BodyguardRuntime.BodyguardPlayerComponent.ClientOnVIPHasBeenReassigned
// 0x0008 (0x0008 - 0x0000)
struct BodyguardPlayerComponent_ClientOnVIPHasBeenReassigned final
{
public:
	const class AFortPlayerStateAthena*           NewVIPlayerState;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BodyguardPlayerComponent_ClientOnVIPHasBeenReassigned;

// Function BodyguardRuntime.BodyguardPlayerComponent.OnEmoteMontageEnded
// 0x0010 (0x0010 - 0x0000)
struct BodyguardPlayerComponent_OnEmoteMontageEnded final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BodyguardPlayerComponent_OnEmoteMontageEnded;

// Function BodyguardRuntime.BodyguardPlayerComponent.OnFortPCPawnChangedEvent
// 0x0008 (0x0008 - 0x0000)
struct BodyguardPlayerComponent_OnFortPCPawnChangedEvent final
{
public:
	class AFortPawn*                              NewPawn;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BodyguardPlayerComponent_OnFortPCPawnChangedEvent;

// Function BodyguardRuntime.BodyguardPlayerComponent.OnPawnStartedEmote
// 0x0010 (0x0010 - 0x0000)
struct BodyguardPlayerComponent_OnPawnStartedEmote final
{
public:
	class UFortItemDefinition*                    MontageItemDef;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPawn*                              PawnEmoting;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BodyguardPlayerComponent_OnPawnStartedEmote;

// Function BodyguardRuntime.BodyguardPlayerComponent.OnPlacementSet
// 0x0010 (0x0010 - 0x0000)
struct BodyguardPlayerComponent_OnPlacementSet final
{
public:
	class AFortPlayerStateAthena*                 Sender;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewPlace;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BodyguardPlayerComponent_OnPlacementSet;

// Function BodyguardRuntime.BodyguardPlayerComponent.OnPlayerRevived
// 0x0008 (0x0008 - 0x0000)
struct BodyguardPlayerComponent_OnPlayerRevived final
{
public:
	const class AController*                      EventInstigator;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BodyguardPlayerComponent_OnPlayerRevived;

// Function BodyguardRuntime.BodyguardPlayerComponent.SetIsBodyguardTooFarFromVIP
// 0x0001 (0x0001 - 0x0000)
struct BodyguardPlayerComponent_SetIsBodyguardTooFarFromVIP final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BodyguardPlayerComponent_SetIsBodyguardTooFarFromVIP;

// Function BodyguardRuntime.BodyguardPlayerComponent.IsSkinSwappingEnabled
// 0x0001 (0x0001 - 0x0000)
struct BodyguardPlayerComponent_IsSkinSwappingEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BodyguardPlayerComponent_IsSkinSwappingEnabled;

// Function BodyguardRuntime.BodyguardSoundActor.UpdateTeamVIPHealth_BP
// 0x000C (0x000C - 0x0000)
struct BodyguardSoundActor_UpdateTeamVIPHealth_BP final
{
public:
	float                                         CurrentHealth;                                     // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxHealth;                                         // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLocalPlayerTheVIP;                              // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BodyguardSoundActor_UpdateTeamVIPHealth_BP;

// Function BodyguardRuntime.BodyguardSoundActor.UpdateTeamVIPIsBeingRevived_BP
// 0x0004 (0x0004 - 0x0000)
struct BodyguardSoundActor_UpdateTeamVIPIsBeingRevived_BP final
{
public:
	bool                                          bIsBeingRevived;                                   // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTeamVIP_DBNO;                                   // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsReviving;                                       // 0x0002(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLocalPlayerTheVIP;                              // 0x0003(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BodyguardSoundActor_UpdateTeamVIPIsBeingRevived_BP;

// Function BodyguardRuntime.BodyguardSoundActor.UpdateTeamVIPIsDBNO_BP
// 0x0003 (0x0003 - 0x0000)
struct BodyguardSoundActor_UpdateTeamVIPIsDBNO_BP final
{
public:
	bool                                          bIsTeamVIP_DBNO;                                   // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLocalPlayerTheVIP;                              // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDead;                                           // 0x0002(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BodyguardSoundActor_UpdateTeamVIPIsDBNO_BP;

// Function BodyguardRuntime.FortAthenaMutator_Bodyguard.NotifySquadmatesOnVIPTookDamage
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_Bodyguard_NotifySquadmatesOnVIPTookDamage final
{
public:
	uint8                                         VIPTeam;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Bodyguard_NotifySquadmatesOnVIPTookDamage;

// Function BodyguardRuntime.FortAthenaMutator_Bodyguard.NotifyVIPOnTeammateDBNO
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_Bodyguard_NotifyVIPOnTeammateDBNO final
{
public:
	uint8                                         VIPTeam;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Bodyguard_NotifyVIPOnTeammateDBNO;

// Function BodyguardRuntime.FortAthenaMutator_Bodyguard.ShutOffAnyDBNOSounds
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_Bodyguard_ShutOffAnyDBNOSounds final
{
public:
	bool                                          bIsDead;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Bodyguard_ShutOffAnyDBNOSounds;

// Function BodyguardRuntime.FortAthenaMutator_Bodyguard.UpdateSquadmatesIsReviving
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_Bodyguard_UpdateSquadmatesIsReviving final
{
public:
	uint8                                         VIPTeam;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Bodyguard_UpdateSquadmatesIsReviving;

// Function BodyguardRuntime.FortAthenaMutator_Bodyguard.GetEnemyVIPsRemainingUIDelay
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaMutator_Bodyguard_GetEnemyVIPsRemainingUIDelay final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Bodyguard_GetEnemyVIPsRemainingUIDelay;

// Function BodyguardRuntime.FortAthenaMutator_Bodyguard.GetTeamVIPPlayerData
// 0x0028 (0x0028 - 0x0000)
struct FortAthenaMutator_Bodyguard_GetTeamVIPPlayerData final
{
public:
	uint8                                         TeamNum;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBodyguardVIPPlayerData                OutVIPPlayerData;                                  // 0x0008(0x0018)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaMutator_Bodyguard_GetTeamVIPPlayerData;

// Function BodyguardRuntime.FortAthenaMutator_Bodyguard.IsReviving
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_Bodyguard_IsReviving final
{
public:
	const class AFortPlayerStateAthena*           PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaMutator_Bodyguard_IsReviving;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
