#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_F_Countdown

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_CountdownMaster_classes.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_F_Countdown.BP_F_Countdown_C
// 0x00F8 (0x0430 - 0x0338)
class ABP_F_Countdown_C final : public ABP_CountdownMaster_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_F_Countdown_C;                   // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       Widget_LiveInText;                                 // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Galileo_PlatformBig_Hologram;                   // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         OpacityMult_NewTrack_0_59434E71465EFEA450506AB20D9CDF91; // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            OpacityMult__Direction_59434E71465EFEA450506AB20D9CDF91; // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_355[0x3];                                      // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     OpacityMult;                                       // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Fade_125DD11C45A19A0E56D6C3971DBE9094;  // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_125DD11C45A19A0E56D6C3971DBE9094; // 0x0364(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_365[0x3];                                      // 0x0365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CountdownEvent;                                    // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Stage;                                             // 0x0380(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	float                                         SecondsRemaining;                                  // 0x0384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RepAudio;                                          // 0x0388(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             CountdownMusic;                                    // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Music;                                             // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   StandbyText;                                       // 0x03A0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 CountdownHold;                                     // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FVector                                Hologram_Scale;                                    // 0x03C8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StartingInTextLocation;                            // 0x03D4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StandbyTextLocation;                               // 0x03E0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Blinkamount;                                       // 0x03EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           BlinkHandle;                                       // 0x03F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         TwoMinuteMark;                                     // 0x03F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FC[0x4];                                      // 0x03FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ABP_Generic_TimerManager_C> TimerManager;                                   // 0x0400(0x0028)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	bool                                          Has2MinWarningFired;                               // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_F_Countdown(int32 EntryPoint);
	void Seconds_Updated(int32 SecondsRemaining_0);
	void CreateLocalizedCountdownText();
	void BlinkTimer();
	void ScrubComplete();
	void FadeOut(bool Fade);
	void Stage2();
	void Stage1();
	void ReceiveBeginPlay();
	void OnComplete_CA92DED74DEB26F112504FA002394E57(class UUserWidget* UserWidget);
	void OnEventActive_A4FD7CB742A86161794F5D988537AF67(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio);
	void OnEventUpdated_A4FD7CB742A86161794F5D988537AF67(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio);
	void OnEventEnded_A4FD7CB742A86161794F5D988537AF67(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio);
	void OnReady_711F6A5D45F01521379DF688123B4896();
	void OpacityMult__UpdateFunc();
	void OpacityMult__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void OnRep_Stage();
	void OnRep_PlayAudio();
	void Play_Audio_Internal(float StartTime);
	void StopAudioInternal();
	void OnRep_PlayLoopingAudio();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_F_Countdown_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_F_Countdown_C")
	}
	static class ABP_F_Countdown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_F_Countdown_C>();
	}
};
DUMPER7_ASSERTS_ABP_F_Countdown_C;

SDK_NAMESPACE_END
