#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BuffetInfo

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BuffetInfo.BuffetInfo_C.ExecuteUbergraph_BuffetInfo
// 0x0070 (0x0070 - 0x0000)
struct BuffetInfo_C_ExecuteUbergraph_BuffetInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_EventName;                            // 0x0008(0x0018)(ConstParm)
	class FText                                   K2Node_Event_Date;                                 // 0x0020(0x0018)(ConstParm)
	class FText                                   K2Node_Event_Time;                                 // 0x0038(0x0018)(ConstParm)
	class FText                                   K2Node_Event_AdditionalEvents;                     // 0x0050(0x0018)(ConstParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BuffetInfo_C_ExecuteUbergraph_BuffetInfo;

// Function BuffetInfo.BuffetInfo_C.OnRefreshDisplay
// 0x0060 (0x0060 - 0x0000)
struct BuffetInfo_C_OnRefreshDisplay final
{
public:
	class FText                                   EventName;                                         // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   Date;                                              // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   Time;                                              // 0x0030(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   AdditionalEvents;                                  // 0x0048(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BuffetInfo_C_OnRefreshDisplay;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
