#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DiscoveryBrowserUI

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DiscoveryBrowserUI_structs.hpp"
#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function DiscoveryBrowserUI.FortActivityBrowser.HandleTabChanged
// 0x0008 (0x0008 - 0x0000)
struct FortActivityBrowser_HandleTabChanged final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowser_HandleTabChanged;

// Function DiscoveryBrowserUI.FortActivityBrowser.OnPlayerQueueTypeChanged
// 0x0001 (0x0001 - 0x0000)
struct FortActivityBrowser_OnPlayerQueueTypeChanged final
{
public:
	EPlayerQueueType                              PlayerQueueType;                                   // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowser_OnPlayerQueueTypeChanged;

// Function DiscoveryBrowserUI.FortActivityBrowserRow.HandleMobileScrollCompleted
// 0x0008 (0x0008 - 0x0000)
struct FortActivityBrowserRow_HandleMobileScrollCompleted final
{
public:
	struct FVector2D                              PendingScrollAmounts;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserRow_HandleMobileScrollCompleted;

// Function DiscoveryBrowserUI.FortActivityBrowserRow.HandleUserScrolled
// 0x0004 (0x0004 - 0x0000)
struct FortActivityBrowserRow_HandleUserScrolled final
{
public:
	float                                         CurrentOffset;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserRow_HandleUserScrolled;

// Function DiscoveryBrowserUI.FortActivityBrowserRow.OnCategoryItemChanged
// 0x0002 (0x0002 - 0x0000)
struct FortActivityBrowserRow_OnCategoryItemChanged final
{
public:
	bool                                          bIsActive;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayAnimation;                                    // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserRow_OnCategoryItemChanged;

// Function DiscoveryBrowserUI.FortActivityBrowserRow.OnQueryStatusChanged
// 0x0001 (0x0001 - 0x0000)
struct FortActivityBrowserRow_OnQueryStatusChanged final
{
public:
	bool                                          bIsActive;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserRow_OnQueryStatusChanged;

// Function DiscoveryBrowserUI.FortActivityBrowserRow.OnRowIsActiveChanged
// 0x0001 (0x0001 - 0x0000)
struct FortActivityBrowserRow_OnRowIsActiveChanged final
{
public:
	bool                                          bIsActive;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserRow_OnRowIsActiveChanged;

// Function DiscoveryBrowserUI.FortActivityBrowserRow.OnRowPeekStateChanged
// 0x0001 (0x0001 - 0x0000)
struct FortActivityBrowserRow_OnRowPeekStateChanged final
{
public:
	bool                                          bIsInPeekState;                                    // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserRow_OnRowPeekStateChanged;

// Function DiscoveryBrowserUI.FortActivityBrowserRow.GetIsActive
// 0x0001 (0x0001 - 0x0000)
struct FortActivityBrowserRow_GetIsActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserRow_GetIsActive;

// Function DiscoveryBrowserUI.FortActivityBrowserRow.GetIsInPeekState
// 0x0001 (0x0001 - 0x0000)
struct FortActivityBrowserRow_GetIsInPeekState final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserRow_GetIsInPeekState;

// Function DiscoveryBrowserUI.FortActivityBrowserTag.GetTagType
// 0x0001 (0x0001 - 0x0000)
struct FortActivityBrowserTag_GetTagType final
{
public:
	EFortActivityBrowserTagType                   ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserTag_GetTagType;

// Function DiscoveryBrowserUI.FortActivityBrowserView.OnPreviewImageChanged
// 0x0010 (0x0010 - 0x0000)
struct FortActivityBrowserView_OnPreviewImageChanged final
{
public:
	bool                                          bIsLoading;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UTexture*                         Texture;                                           // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserView_OnPreviewImageChanged;

// Function DiscoveryBrowserUI.FortActivityDetailsDisplay.GetCreatorTextFormat
// 0x0030 (0x0030 - 0x0000)
struct FortActivityDetailsDisplay_GetCreatorTextFormat final
{
public:
	class FText                                   CreatorName;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityDetailsDisplay_GetCreatorTextFormat;

// Function DiscoveryBrowserUI.FortActivityDetailsDisplay.OnIsFavoriteChanged
// 0x0001 (0x0001 - 0x0000)
struct FortActivityDetailsDisplay_OnIsFavoriteChanged final
{
public:
	bool                                          bIsFavorite;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityDetailsDisplay_OnIsFavoriteChanged;

// Function DiscoveryBrowserUI.FortActivityDetailsDisplay.IsActivityEpicOriginal
// 0x0001 (0x0001 - 0x0000)
struct FortActivityDetailsDisplay_IsActivityEpicOriginal final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityDetailsDisplay_IsActivityEpicOriginal;

// Function DiscoveryBrowserUI.FortActivityDetailsModal.OnPartySizeChanged
// 0x0004 (0x0004 - 0x0000)
struct FortActivityDetailsModal_OnPartySizeChanged final
{
public:
	int32                                         PartySize;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityDetailsModal_OnPartySizeChanged;

// Function DiscoveryBrowserUI.FortActivityDetailsModal.OnPreviewImageChanged
// 0x0010 (0x0010 - 0x0000)
struct FortActivityDetailsModal_OnPreviewImageChanged final
{
public:
	bool                                          bIsLoading;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UTexture*                         Texture;                                           // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityDetailsModal_OnPreviewImageChanged;

// Function DiscoveryBrowserUI.FortActivityDetailsModal.GetInvalidActivityReason
// 0x0001 (0x0001 - 0x0000)
struct FortActivityDetailsModal_GetInvalidActivityReason final
{
public:
	EFortInvalidActivityReason                    ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityDetailsModal_GetInvalidActivityReason;

// Function DiscoveryBrowserUI.FortActivityDetailsSettingsWidget.OnSettingChanged
// 0x0001 (0x0001 - 0x0000)
struct FortActivityDetailsSettingsWidget_OnSettingChanged final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityDetailsSettingsWidget_OnSettingChanged;

// Function DiscoveryBrowserUI.FortActivityListView.HandleMobileScrollCompleted
// 0x0008 (0x0008 - 0x0000)
struct FortActivityListView_HandleMobileScrollCompleted final
{
public:
	struct FVector2D                              PendingScrollAmounts;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityListView_HandleMobileScrollCompleted;

// Function DiscoveryBrowserUI.FortActivitySearchView.HandleTextChanged
// 0x0018 (0x0018 - 0x0000)
struct FortActivitySearchView_HandleTextChanged final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivitySearchView_HandleTextChanged;

// Function DiscoveryBrowserUI.FortActivitySearchView.HandleTextCommitted
// 0x0020 (0x0020 - 0x0000)
struct FortActivitySearchView_HandleTextCommitted final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	ETextCommit                                   CommitInfo;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortActivitySearchView_HandleTextCommitted;

// Function DiscoveryBrowserUI.FortActivitySearchView.OnActivityValidated
// 0x0001 (0x0001 - 0x0000)
struct FortActivitySearchView_OnActivityValidated final
{
public:
	EFortActivityValidationResult                 ValidateResult;                                    // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivitySearchView_OnActivityValidated;

// Function DiscoveryBrowserUI.FortActivityTileDetailsDisplay.OnIsFavoriteChanged
// 0x0001 (0x0001 - 0x0000)
struct FortActivityTileDetailsDisplay_OnIsFavoriteChanged final
{
public:
	bool                                          bIsFavorite;                                       // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityTileDetailsDisplay_OnIsFavoriteChanged;

// Function DiscoveryBrowserUI.FortActivityTileDetailsDisplay.OnPartySizeChanged
// 0x0004 (0x0004 - 0x0000)
struct FortActivityTileDetailsDisplay_OnPartySizeChanged final
{
public:
	int32                                         PartySize;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityTileDetailsDisplay_OnPartySizeChanged;

// Function DiscoveryBrowserUI.FortActivityTileDetailsDisplay.OnPreviewImageChanged
// 0x0010 (0x0010 - 0x0000)
struct FortActivityTileDetailsDisplay_OnPreviewImageChanged final
{
public:
	bool                                          bIsLoading;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UTexture*                         Texture;                                           // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityTileDetailsDisplay_OnPreviewImageChanged;

// Function DiscoveryBrowserUI.FortActivityTileDetailsDisplay.OnTileActiveSet
// 0x0001 (0x0001 - 0x0000)
struct FortActivityTileDetailsDisplay_OnTileActiveSet final
{
public:
	bool                                          bIsTileActive;                                     // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityTileDetailsDisplay_OnTileActiveSet;

// Function DiscoveryBrowserUI.FortActivityTileDetailsDisplay.GetInvalidActivityReason
// 0x0001 (0x0001 - 0x0000)
struct FortActivityTileDetailsDisplay_GetInvalidActivityReason final
{
public:
	EFortInvalidActivityReason                    ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityTileDetailsDisplay_GetInvalidActivityReason;

// Function DiscoveryBrowserUI.FortActivityTileDetailsDisplay.IsActivityEpicCreated
// 0x0001 (0x0001 - 0x0000)
struct FortActivityTileDetailsDisplay_IsActivityEpicCreated final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityTileDetailsDisplay_IsActivityEpicCreated;

// Function DiscoveryBrowserUI.FortActivityTileDetailsDisplay.IsActivityFavorited
// 0x0001 (0x0001 - 0x0000)
struct FortActivityTileDetailsDisplay_IsActivityFavorited final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityTileDetailsDisplay_IsActivityFavorited;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
