#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DynamicHUD

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DynamicHUD_structs.hpp"
#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START

// Class DynamicHUD.DynamicHUDDirectorBase
// 0x0010 (0x0230 - 0x0220)
class ADynamicHUDDirectorBase : public AActor
{
public:
	TArray<class UDynamicHUDScene*>               DefaultScenes;                                     // 0x0220(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DynamicHUDDirectorBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DynamicHUDDirectorBase")
	}
	static class ADynamicHUDDirectorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADynamicHUDDirectorBase>();
	}
};
DUMPER7_ASSERTS_ADynamicHUDDirectorBase;

// Class DynamicHUD.DynamicHUDConstraintBase
// 0x0048 (0x0070 - 0x0028)
class UDynamicHUDConstraintBase : public UObject
{
public:
	uint8                                         Pad_28[0x38];                                      // 0x0028(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class UDynamicHUDConstraintOverrideBase*      ConstraintOverride;                                // 0x0060(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bUseOverride : 1;                                  // 0x0068(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DynamicHUDConstraintBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DynamicHUDConstraintBase")
	}
	static class UDynamicHUDConstraintBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicHUDConstraintBase>();
	}
};
DUMPER7_ASSERTS_UDynamicHUDConstraintBase;

// Class DynamicHUD.DynamicHUDConstraintAlignment
// 0x0008 (0x0078 - 0x0070)
class UDynamicHUDConstraintAlignment final : public UDynamicHUDConstraintBase
{
public:
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0070(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EVerticalAlignment                            VerticalAlignment;                                 // 0x0071(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	EDynamicHUDAnchor                             Anchor;                                            // 0x0074(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DynamicHUDConstraintAlignment")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DynamicHUDConstraintAlignment")
	}
	static class UDynamicHUDConstraintAlignment* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicHUDConstraintAlignment>();
	}
};
DUMPER7_ASSERTS_UDynamicHUDConstraintAlignment;

// Class DynamicHUD.DynamicHUDConstraintOverrideBase
// 0x0000 (0x0028 - 0x0028)
class UDynamicHUDConstraintOverrideBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DynamicHUDConstraintOverrideBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DynamicHUDConstraintOverrideBase")
	}
	static class UDynamicHUDConstraintOverrideBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicHUDConstraintOverrideBase>();
	}
};
DUMPER7_ASSERTS_UDynamicHUDConstraintOverrideBase;

// Class DynamicHUD.DynamicHUDConstraintPosition
// 0x0010 (0x0080 - 0x0070)
class UDynamicHUDConstraintPosition final : public UDynamicHUDConstraintBase
{
public:
	struct FVector2D                              Position;                                          // 0x0070(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EDynamicHUDAnchor                             Anchor;                                            // 0x0078(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DynamicHUDConstraintPosition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DynamicHUDConstraintPosition")
	}
	static class UDynamicHUDConstraintPosition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicHUDConstraintPosition>();
	}
};
DUMPER7_ASSERTS_UDynamicHUDConstraintPosition;

// Class DynamicHUD.DynamicHUDConstraintWidget
// 0x0040 (0x00B0 - 0x0070)
class UDynamicHUDConstraintWidget final : public UDynamicHUDConstraintBase
{
public:
	EDynamicHUDAnchor                             Anchor;                                            // 0x0070(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   TargetWidget;                                      // 0x0078(0x0028)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   TargetUniqueID;                                    // 0x00A0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EDynamicHUDAnchor                             TargetAnchor;                                      // 0x00A8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EDynamicHUDStrength                           Strength;                                          // 0x00AC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DynamicHUDConstraintWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DynamicHUDConstraintWidget")
	}
	static class UDynamicHUDConstraintWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicHUDConstraintWidget>();
	}
};
DUMPER7_ASSERTS_UDynamicHUDConstraintWidget;

// Class DynamicHUD.DynamicHUDConstraintComparison
// 0x0050 (0x00C0 - 0x0070)
class UDynamicHUDConstraintComparison final : public UDynamicHUDConstraintBase
{
public:
	EDynamicHUDSide                               Side;                                              // 0x0070(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Offset;                                            // 0x0074(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EDynamicHUDComparison                         Comparison;                                        // 0x0078(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   TargetWidget;                                      // 0x0080(0x0028)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   TargetUniqueID;                                    // 0x00A8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EDynamicHUDSide                               TargetSide;                                        // 0x00B0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TargetOffset;                                      // 0x00B4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EDynamicHUDStrength                           Strength;                                          // 0x00B8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DynamicHUDConstraintComparison")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DynamicHUDConstraintComparison")
	}
	static class UDynamicHUDConstraintComparison* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicHUDConstraintComparison>();
	}
};
DUMPER7_ASSERTS_UDynamicHUDConstraintComparison;

// Class DynamicHUD.DynamicHUDConstraintEquation
// 0x0048 (0x00B8 - 0x0070)
class UDynamicHUDConstraintEquation final : public UDynamicHUDConstraintBase
{
public:
	EDynamicHUDSide                               Side;                                              // 0x0070(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EDynamicHUDOperator                           Operator;                                          // 0x0074(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   TargetWidget;                                      // 0x0078(0x0028)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   TargetUniqueID;                                    // 0x00A0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EDynamicHUDSide                               TargetSide;                                        // 0x00A8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EDynamicHUDComparison                         Comparison;                                        // 0x00AC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Result;                                            // 0x00B0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EDynamicHUDStrength                           Strength;                                          // 0x00B4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DynamicHUDConstraintEquation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DynamicHUDConstraintEquation")
	}
	static class UDynamicHUDConstraintEquation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicHUDConstraintEquation>();
	}
};
DUMPER7_ASSERTS_UDynamicHUDConstraintEquation;

// Class DynamicHUD.DynamicHUDManager
// 0x0108 (0x0138 - 0x0030)
class UDynamicHUDManager final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x40];                                      // 0x0030(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UDynamicHUDScene*, struct FContextData> ActiveScenes;                                 // 0x0070(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C0[0x28];                                      // 0x00C0(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, struct FDirectorData>     ActiveDirectors;                                   // 0x00E8(0x0050)(Transient, NativeAccessSpecifierPrivate)

public:
	void AddScene(const class UDynamicHUDScene* Scene, const class UObject* OptionalContext);
	void AddScenes(const TArray<class UDynamicHUDScene*>& Scenes, const class UObject* OptionalContext);
	void ChangeLayoutPanelZOrder(int32 InZOrder);
	void RemoveScene(const class UDynamicHUDScene* Scene, const class UObject* OptionalContext);
	void RemoveScenes(const TArray<class UDynamicHUDScene*>& Scenes, const class UObject* OptionalContext);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DynamicHUDManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DynamicHUDManager")
	}
	static class UDynamicHUDManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicHUDManager>();
	}
};
DUMPER7_ASSERTS_UDynamicHUDManager;

// Class DynamicHUD.DynamicHUDScene
// 0x0020 (0x0050 - 0x0030)
class UDynamicHUDScene final : public UDataAsset
{
public:
	TArray<struct FDynamicHUDAllowed>             Allowed;                                           // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FDynamicHUDUnallowed>           Unallowed;                                         // 0x0040(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DynamicHUDScene")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DynamicHUDScene")
	}
	static class UDynamicHUDScene* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicHUDScene>();
	}
};
DUMPER7_ASSERTS_UDynamicHUDScene;

// Class DynamicHUD.DynamicHUDVisualizerWidget
// 0x0028 (0x0288 - 0x0260)
class UDynamicHUDVisualizerWidget final : public UUserWidget
{
public:
	TArray<class UDynamicHUDScene*>               Scenes;                                            // 0x0260(0x0010)(Edit, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	bool                                          bRefresh;                                          // 0x0270(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_271[0x17];                                     // 0x0271(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DynamicHUDVisualizerWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DynamicHUDVisualizerWidget")
	}
	static class UDynamicHUDVisualizerWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicHUDVisualizerWidget>();
	}
};
DUMPER7_ASSERTS_UDynamicHUDVisualizerWidget;

SDK_NAMESPACE_END
