#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HermesPlaysetsUI

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function HermesPlaysetsUI.HermesPlaysetsDirector.CanAddProject
// 0x0001 (0x0001 - 0x0000)
struct HermesPlaysetsDirector_CanAddProject final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HermesPlaysetsDirector_CanAddProject;

// Function HermesPlaysetsUI.HermesPlaysetsDirector.HandlePlaysetDownloadedSuccess
// 0x0001 (0x0001 - 0x0000)
struct HermesPlaysetsDirector_HandlePlaysetDownloadedSuccess final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HermesPlaysetsDirector_HandlePlaysetDownloadedSuccess;

// Function HermesPlaysetsUI.HermesPlaysetsDirector.HermesPlaysetDownloadedOnServer
// 0x0001 (0x0001 - 0x0000)
struct HermesPlaysetsDirector_HermesPlaysetDownloadedOnServer final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HermesPlaysetsDirector_HermesPlaysetDownloadedOnServer;

// Function HermesPlaysetsUI.HermesPlaysetsDirector.HermesPlaysetLinkCodeResolved
// 0x0028 (0x0028 - 0x0000)
struct HermesPlaysetsDirector_HermesPlaysetLinkCodeResolved final
{
public:
	class FString                                 InLinkCode;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InProjectId;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSuccess;                                          // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_HermesPlaysetsDirector_HermesPlaysetLinkCodeResolved;

// Function HermesPlaysetsUI.HermesPlaysetsDirector.LinkCodeMetaDataLoaded
// 0x0030 (0x0030 - 0x0000)
struct HermesPlaysetsDirector_LinkCodeMetaDataLoaded final
{
public:
	class FString                                 InLinkCode;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InProjectId;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InTitleString;                                     // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HermesPlaysetsDirector_LinkCodeMetaDataLoaded;

// Function HermesPlaysetsUI.HermesPlaysetsDirector.LoadLinkCodeMetaData
// 0x0030 (0x0030 - 0x0000)
struct HermesPlaysetsDirector_LoadLinkCodeMetaData final
{
public:
	class FString                                 InLinkCode;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InProjectId;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerControllerAthena*            InFortPlayerControllerAthena;                      // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_HermesPlaysetsDirector_LoadLinkCodeMetaData;

// Function HermesPlaysetsUI.HermesPlaysetsDirector.OnNewLinkCodeChanged
// 0x0010 (0x0010 - 0x0000)
struct HermesPlaysetsDirector_OnNewLinkCodeChanged final
{
public:
	TArray<class FString>                         UpdatedLinkCodes;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HermesPlaysetsDirector_OnNewLinkCodeChanged;

// Function HermesPlaysetsUI.HermesPlaysetsDirector.RequestLinkCodePreviewFromCode
// 0x0020 (0x0020 - 0x0000)
struct HermesPlaysetsDirector_RequestLinkCodePreviewFromCode final
{
public:
	class FString                                 InCode;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerControllerAthena*            InFortPlayerControllerAthena;                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_HermesPlaysetsDirector_RequestLinkCodePreviewFromCode;

// Function HermesPlaysetsUI.HermesPlaysetsDirector.RequestPlaysetFromCode
// 0x0040 (0x0040 - 0x0000)
struct HermesPlaysetsDirector_RequestPlaysetFromCode final
{
public:
	class FString                                 InCode;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InProjectId;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InTitleName;                                       // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerControllerAthena*            InFortPlayerControllerAthena;                      // 0x0030(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_HermesPlaysetsDirector_RequestPlaysetFromCode;

// Function HermesPlaysetsUI.HermesPlaysetsDirector.CanAddLinkCode
// 0x0018 (0x0018 - 0x0000)
struct HermesPlaysetsDirector_CanAddLinkCode final
{
public:
	class FString                                 InLinkCode;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_HermesPlaysetsDirector_CanAddLinkCode;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
