#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KiwiPlaylistRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function KiwiPlaylistRuntime.KiwiPawnComponent.HandlePawnEnterWaterBody
// 0x0008 (0x0008 - 0x0000)
struct KiwiPawnComponent_HandlePawnEnterWaterBody final
{
public:
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KiwiPawnComponent_HandlePawnEnterWaterBody;

// Function KiwiPlaylistRuntime.KiwiPawnComponent.HandlePawnExitWaterBody
// 0x0010 (0x0010 - 0x0000)
struct KiwiPawnComponent_HandlePawnExitWaterBody final
{
public:
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPawnIsOutsideOfAllWaterBodies;                    // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KiwiPawnComponent_HandlePawnExitWaterBody;

// Function KiwiPlaylistRuntime.FortAthenaMutator_Kiwi.BeginAsyncLoadOfItem
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Kiwi_BeginAsyncLoadOfItem final
{
public:
	const class UFortItemDefinition*              ItemToLoad;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Kiwi_BeginAsyncLoadOfItem;

// Function KiwiPlaylistRuntime.FortAthenaMutator_Kiwi.HandleKiwiMannequinDestroyed
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Kiwi_HandleKiwiMannequinDestroyed final
{
public:
	class AActor*                                 MannequinActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Kiwi_HandleKiwiMannequinDestroyed;

// Function KiwiPlaylistRuntime.FortAthenaMutator_Kiwi.HandleKiwiNevadaVehicleDestroyed
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Kiwi_HandleKiwiNevadaVehicleDestroyed final
{
public:
	class AActor*                                 NevadaVehicleActor;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Kiwi_HandleKiwiNevadaVehicleDestroyed;

// Function KiwiPlaylistRuntime.FortAthenaMutator_Kiwi.HandlePlayerOnDisconnectedChanged
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_Kiwi_HandlePlayerOnDisconnectedChanged final
{
public:
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDisconnected;                                   // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaMutator_Kiwi_HandlePlayerOnDisconnectedChanged;

// Function KiwiPlaylistRuntime.FortAthenaMutator_Kiwi.RegisterKiwiLocalVOManagerActor
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Kiwi_RegisterKiwiLocalVOManagerActor final
{
public:
	class AActor*                                 InManager;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Kiwi_RegisterKiwiLocalVOManagerActor;

// Function KiwiPlaylistRuntime.FortAthenaMutator_Kiwi.RegisterKiwiMannequin
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Kiwi_RegisterKiwiMannequin final
{
public:
	class AFortPlayerMannequin*                   Mannequin;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Kiwi_RegisterKiwiMannequin;

// Function KiwiPlaylistRuntime.FortAthenaMutator_Kiwi.RegisterKiwiNevadaVehicle
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Kiwi_RegisterKiwiNevadaVehicle final
{
public:
	class ASkeletalMeshActor*                     NevadaVehicle;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Kiwi_RegisterKiwiNevadaVehicle;

// Function KiwiPlaylistRuntime.FortAthenaMutator_Kiwi.RegisterPrisonAlienPatrolSequenceActor
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Kiwi_RegisterPrisonAlienPatrolSequenceActor final
{
public:
	class ALevelSequenceActor*                    LevelSequenceActor;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Kiwi_RegisterPrisonAlienPatrolSequenceActor;

// Function KiwiPlaylistRuntime.FortAthenaMutator_Kiwi.SetActiveTimeOfDayManagerByTag
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Kiwi_SetActiveTimeOfDayManagerByTag final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Kiwi_SetActiveTimeOfDayManagerByTag;

// Function KiwiPlaylistRuntime.FortAthenaMutator_Kiwi.SetEnabledGameplayCueRecycling
// 0x0002 (0x0002 - 0x0000)
struct FortAthenaMutator_Kiwi_SetEnabledGameplayCueRecycling final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Kiwi_SetEnabledGameplayCueRecycling;

// Function KiwiPlaylistRuntime.FortAthenaMutator_Kiwi.SetKiwiSequenceActor
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Kiwi_SetKiwiSequenceActor final
{
public:
	class ALevelSequenceActor*                    SequenceActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Kiwi_SetKiwiSequenceActor;

// Function KiwiPlaylistRuntime.FortAthenaMutator_Kiwi.GetKiwiLocalVOManagerActor
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Kiwi_GetKiwiLocalVOManagerActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Kiwi_GetKiwiLocalVOManagerActor;

// Function KiwiPlaylistRuntime.FortAthenaMutator_Kiwi.GetKiwiSequenceActor
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Kiwi_GetKiwiSequenceActor final
{
public:
	class ALevelSequenceActor*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Kiwi_GetKiwiSequenceActor;

// Function KiwiPlaylistRuntime.FortAthenaMutator_Kiwi.GetRegisteredKiwiMannequins
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_Kiwi_GetRegisteredKiwiMannequins final
{
public:
	TArray<class AFortPlayerMannequin*>           ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Kiwi_GetRegisteredKiwiMannequins;

// Function KiwiPlaylistRuntime.FortAthenaMutator_Kiwi.GetRegisteredKiwiNevadaVehicles
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_Kiwi_GetRegisteredKiwiNevadaVehicles final
{
public:
	TArray<class ASkeletalMeshActor*>             ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Kiwi_GetRegisteredKiwiNevadaVehicles;

// Function KiwiPlaylistRuntime.FortAthenaMutator_Kiwi.GetRegisteredPrisonAlienPatrolSequenceActors
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_Kiwi_GetRegisteredPrisonAlienPatrolSequenceActors final
{
public:
	TArray<class ALevelSequenceActor*>            ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Kiwi_GetRegisteredPrisonAlienPatrolSequenceActors;

// Function KiwiPlaylistRuntime.FortCheatManager_KiwiRelevancy.KiwiStartKevinRoomZapping
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_KiwiRelevancy_KiwiStartKevinRoomZapping final
{
public:
	float                                         ZapInterval;                                       // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_KiwiRelevancy_KiwiStartKevinRoomZapping;

// Function KiwiPlaylistRuntime.FortAthenaMutator_KiwiRelevancy.KevinRoomStartZappingSquads
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaMutator_KiwiRelevancy_KevinRoomStartZappingSquads final
{
public:
	float                                         ZapInterval;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_KiwiRelevancy_KevinRoomStartZappingSquads;

// Function KiwiPlaylistRuntime.FortAthenaMutator_KiwiRelevancy.ZapSquads
// 0x000C (0x000C - 0x0000)
struct FortAthenaMutator_KiwiRelevancy_ZapSquads final
{
public:
	int32                                         FromIndex;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ToIndex;                                           // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MatchingOffset;                                    // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_KiwiRelevancy_ZapSquads;

// Function KiwiPlaylistRuntime.KiwiControllerComponent.ClientSetEnableKevinCubeInteract
// 0x0010 (0x0010 - 0x0000)
struct KiwiControllerComponent_ClientSetEnableKevinCubeInteract final
{
public:
	const class AKiwiKevinCubeInteractActor*      KevinCubeInteractActor;                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInteracting;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KiwiControllerComponent_ClientSetEnableKevinCubeInteract;

// Function KiwiPlaylistRuntime.KiwiControllerComponent.ClientSetupSpaceMannequins
// 0x0010 (0x0010 - 0x0000)
struct KiwiControllerComponent_ClientSetupSpaceMannequins final
{
public:
	TArray<class AFortPlayerPawn*>                PlayerPawnsToLoadoutCopy;                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KiwiControllerComponent_ClientSetupSpaceMannequins;

// Function KiwiPlaylistRuntime.KiwiControllerComponent.ClientZapPawns
// 0x0018 (0x0018 - 0x0000)
struct KiwiControllerComponent_ClientZapPawns final
{
public:
	TArray<class AFortPlayerPawn*>                PawnsToKill;                                       // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ZapReason;                                         // 0x0010(0x0008)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KiwiControllerComponent_ClientZapPawns;

// Function KiwiPlaylistRuntime.KiwiControllerComponent.OnMovementModeChanged
// 0x0010 (0x0010 - 0x0000)
struct KiwiControllerComponent_OnMovementModeChanged final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMovementMode                                 PreviousMovementMode;                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         PreviousCustomMode;                                // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KiwiControllerComponent_OnMovementModeChanged;

// Function KiwiPlaylistRuntime.KiwiControllerComponent.OnPlayerPawnPossessed
// 0x0008 (0x0008 - 0x0000)
struct KiwiControllerComponent_OnPlayerPawnPossessed final
{
public:
	class APawn*                                  PossessedPawn;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KiwiControllerComponent_OnPlayerPawnPossessed;

// Function KiwiPlaylistRuntime.KiwiControllerComponent.OnSkyTubeChanged
// 0x0018 (0x0018 - 0x0000)
struct KiwiControllerComponent_OnSkyTubeChanged final
{
public:
	class AFortPlayerPawn*                        Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortSkyTube*                           NewSkyTube;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortSkyTube*                           OldSkyTube;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KiwiControllerComponent_OnSkyTubeChanged;

// Function KiwiPlaylistRuntime.KiwiControllerComponent.PlayPawnZapEffects
// 0x0018 (0x0018 - 0x0000)
struct KiwiControllerComponent_PlayPawnZapEffects final
{
public:
	TArray<class AFortPlayerPawn*>                PawnsToKill;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ZapReason;                                         // 0x0010(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KiwiControllerComponent_PlayPawnZapEffects;

// Function KiwiPlaylistRuntime.KiwiControllerComponent.RegisterLocalSpaceMannequin
// 0x0010 (0x0010 - 0x0000)
struct KiwiControllerComponent_RegisterLocalSpaceMannequin final
{
public:
	class AFortPlayerMannequin*                   SpacePlayerMannequin;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MannequinIndex;                                    // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KiwiControllerComponent_RegisterLocalSpaceMannequin;

// Function KiwiPlaylistRuntime.KiwiControllerComponent.UpdateSpaceMannequinCosmeticLoadout
// 0x0148 (0x0148 - 0x0000)
struct KiwiControllerComponent_UpdateSpaceMannequinCosmeticLoadout final
{
public:
	class AFortPlayerMannequin*                   Mannequin;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortAthenaLoadout                     Loadout;                                           // 0x0008(0x0140)(ConstParm, Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KiwiControllerComponent_UpdateSpaceMannequinCosmeticLoadout;

// Function KiwiPlaylistRuntime.KiwiControllerComponent.GetPrisonAlienPatrolSequenceActorForBlock
// 0x0010 (0x0010 - 0x0000)
struct KiwiControllerComponent_GetPrisonAlienPatrolSequenceActorForBlock final
{
public:
	struct FGameplayTag                           PrisonBlockTag;                                    // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ALevelSequenceActor*                    ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KiwiControllerComponent_GetPrisonAlienPatrolSequenceActorForBlock;

// Function KiwiPlaylistRuntime.KiwiControllerComponent.GetPrisonTeleportSquadStart
// 0x0008 (0x0008 - 0x0000)
struct KiwiControllerComponent_GetPrisonTeleportSquadStart final
{
public:
	const class AFortSquadStart*                  ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KiwiControllerComponent_GetPrisonTeleportSquadStart;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
