#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KiwiRuntime

#include "Basic.hpp"

#include "KiwiRuntime_structs.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function KiwiRuntime.KiwiTubeItems.OnPlayerHitItem
// 0x0088 (0x0088 - 0x0000)
struct KiwiTubeItems_OnPlayerHitItem final
{
public:
	class AFortPlayerPawn*                        Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKiwiTubeItemDef                       HitItem;                                           // 0x0008(0x0058)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FKiwiTubeItemType                      HitItemType;                                       // 0x0060(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KiwiTubeItems_OnPlayerHitItem;

// Function KiwiRuntime.KiwiTubeItems.OnTubeMeshComponentOverlap
// 0x00A8 (0x00A8 - 0x0000)
struct KiwiTubeItems_OnTubeMeshComponentOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KiwiTubeItems_OnTubeMeshComponentOverlap;

// Function KiwiRuntime.KiwiTubeItems.SetFlowDirection
// 0x0001 (0x0001 - 0x0000)
struct KiwiTubeItems_SetFlowDirection final
{
public:
	ETubeFlowDirection                            NewFlowDirection;                                  // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KiwiTubeItems_SetFlowDirection;

// Function KiwiRuntime.KiwiTubeItems.CanEnableCollisionOnItems
// 0x0001 (0x0001 - 0x0000)
struct KiwiTubeItems_CanEnableCollisionOnItems final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KiwiTubeItems_CanEnableCollisionOnItems;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
