#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PageNavigatorPipButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass PageNavigatorPipButton.PageNavigatorPipButton_C
// 0x0030 (0x0CF8 - 0x0CC8)
class UPageNavigatorPipButton_C final : public UFortTextButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0CC8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0CD0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x0CD8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BacchusMobileShadow;                               // 0x0CE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_RightStick;                     // 0x0CE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PIP;                                               // 0x0CF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PageNavigatorPipButton(int32 EntryPoint);
	void Set_Pip_Colors(const struct FLinearColor& Base_Color, const struct FLinearColor& Hover_Color, const struct FLinearColor& Select_Color);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void BP_OnSelected();
	void BP_OnDeselected();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PageNavigatorPipButton_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PageNavigatorPipButton_C")
	}
	static class UPageNavigatorPipButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPageNavigatorPipButton_C>();
	}
};
DUMPER7_ASSERTS_UPageNavigatorPipButton_C;

SDK_NAMESPACE_END
