#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkyfireRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "SkyfireRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function SkyfireRuntime.FortAthenaMutator_Skyfire.ModifySecurityOrbCount
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaMutator_Skyfire_ModifySecurityOrbCount final
{
public:
	int32                                         Amount;                                            // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Skyfire_ModifySecurityOrbCount;

// Function SkyfireRuntime.FortAthenaMutator_Skyfire.ModifyTimeOrbCount
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaMutator_Skyfire_ModifyTimeOrbCount final
{
public:
	int32                                         Amount;                                            // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Skyfire_ModifyTimeOrbCount;

// Function SkyfireRuntime.FortAthenaMutator_Skyfire.OnLootRarityPickup
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Skyfire_OnLootRarityPickup final
{
public:
	const class AFortPlayerStateAthena*           PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Skyfire_OnLootRarityPickup;

// Function SkyfireRuntime.FortAthenaMutator_Skyfire.OnPlayerKnockedOutOfPlayspace
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_Skyfire_OnPlayerKnockedOutOfPlayspace final
{
public:
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 HitOutOfBoundsVolume;                              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Skyfire_OnPlayerKnockedOutOfPlayspace;

// Function SkyfireRuntime.FortAthenaMutator_Skyfire.OnPlayerLootedChest
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_Skyfire_OnPlayerLootedChest final
{
public:
	class AFortPlayerPawnAthena*                  PlayerPawn;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ABuildingContainer*                     LootedContainer;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Skyfire_OnPlayerLootedChest;

// Function SkyfireRuntime.FortAthenaMutator_Skyfire.OnPlayerTeleportToPrisonComplete_Internal
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Skyfire_OnPlayerTeleportToPrisonComplete_Internal final
{
public:
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Skyfire_OnPlayerTeleportToPrisonComplete_Internal;

// Function SkyfireRuntime.FortAthenaMutator_Skyfire.OnRep_SecurityOrbCount
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaMutator_Skyfire_OnRep_SecurityOrbCount final
{
public:
	int32                                         SecurityOrbCountPreReplication;                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Skyfire_OnRep_SecurityOrbCount;

// Function SkyfireRuntime.FortAthenaMutator_Skyfire.OnRep_TimeOrbCount
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaMutator_Skyfire_OnRep_TimeOrbCount final
{
public:
	int32                                         TimeOrbCountPreReplication;                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Skyfire_OnRep_TimeOrbCount;

// Function SkyfireRuntime.FortAthenaMutator_Skyfire.OnTimePickup
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Skyfire_OnTimePickup final
{
public:
	const class AFortPlayerStateAthena*           PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Skyfire_OnTimePickup;

// Function SkyfireRuntime.FortAthenaMutator_Skyfire.GetFlavorTextCountdownThreshold
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaMutator_Skyfire_GetFlavorTextCountdownThreshold final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Skyfire_GetFlavorTextCountdownThreshold;

// Function SkyfireRuntime.FortAthenaMutator_Skyfire.GetInitialLootRarity
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_Skyfire_GetInitialLootRarity final
{
public:
	EFortRarity                                   ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Skyfire_GetInitialLootRarity;

// Function SkyfireRuntime.FortAthenaMutator_Skyfire.GetInitialTimeBeforeLootRoomTeleport
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaMutator_Skyfire_GetInitialTimeBeforeLootRoomTeleport final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Skyfire_GetInitialTimeBeforeLootRoomTeleport;

// Function SkyfireRuntime.FortAthenaMutator_Skyfire.GetNumberOfPlayersInMothership
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Skyfire_GetNumberOfPlayersInMothership final
{
public:
	bool                                          bIncludeLootRoom;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeBots;                                      // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Skyfire_GetNumberOfPlayersInMothership;

// Function SkyfireRuntime.FortAthenaMutator_Skyfire.GetPlayersInMothership
// 0x0018 (0x0018 - 0x0000)
struct FortAthenaMutator_Skyfire_GetPlayersInMothership final
{
public:
	bool                                          bIncludeLootRoom;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeBots;                                      // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerStateAthena*>         ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Skyfire_GetPlayersInMothership;

// Function SkyfireRuntime.FortAthenaMutator_Skyfire.GetSecurityOrbCount
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaMutator_Skyfire_GetSecurityOrbCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Skyfire_GetSecurityOrbCount;

// Function SkyfireRuntime.FortAthenaMutator_Skyfire.GetSkydiveSpawnCircle
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_Skyfire_GetSkydiveSpawnCircle final
{
public:
	struct FVector                                SkydiveSpawnCenter;                                // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SkydiveSpawnRadius;                                // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Skyfire_GetSkydiveSpawnCircle;

// Function SkyfireRuntime.FortAthenaMutator_Skyfire.GetSkyfireAudioManager
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Skyfire_GetSkyfireAudioManager final
{
public:
	class ASkyfireAudioManager*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Skyfire_GetSkyfireAudioManager;

// Function SkyfireRuntime.FortAthenaMutator_Skyfire.GetSkyfirePhase
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_Skyfire_GetSkyfirePhase final
{
public:
	ESkyfirePhase                                 ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Skyfire_GetSkyfirePhase;

// Function SkyfireRuntime.FortAthenaMutator_Skyfire.GetSkyfireSquadDataEntry
// 0x0088 (0x0088 - 0x0000)
struct FortAthenaMutator_Skyfire_GetSkyfireSquadDataEntry final
{
public:
	uint8                                         SquadId;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSkyfireSquadDataEntry                 ReturnValue;                                       // 0x0008(0x0080)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Skyfire_GetSkyfireSquadDataEntry;

// Function SkyfireRuntime.FortAthenaMutator_Skyfire.GetTimeOrbCount
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaMutator_Skyfire_GetTimeOrbCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Skyfire_GetTimeOrbCount;

// Function SkyfireRuntime.FortAthenaMutator_Skyfire.IsFeelingFlavorTextEnabled
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_Skyfire_IsFeelingFlavorTextEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Skyfire_IsFeelingFlavorTextEnabled;

// Function SkyfireRuntime.FortAthenaMutator_Skyfire.IsPawnLocalOrCurrentlyViewed
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_Skyfire_IsPawnLocalOrCurrentlyViewed final
{
public:
	const class AFortPlayerPawnAthena*            InPawnToCheck;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaMutator_Skyfire_IsPawnLocalOrCurrentlyViewed;

// Function SkyfireRuntime.FortAthenaMutator_Skyfire.IsPerformanceFlavorTextEnabled
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_Skyfire_IsPerformanceFlavorTextEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Skyfire_IsPerformanceFlavorTextEnabled;

// Function SkyfireRuntime.FortAthenaMutator_Skyfire.IsPlayerBeingAbducted
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_Skyfire_IsPlayerBeingAbducted final
{
public:
	const class AFortPlayerStateAthena*           PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaMutator_Skyfire_IsPlayerBeingAbducted;

// Function SkyfireRuntime.FortCheatManager_Skyfire.SkyfireSetLootRarityEarned
// 0x0001 (0x0001 - 0x0000)
struct FortCheatManager_Skyfire_SkyfireSetLootRarityEarned final
{
public:
	uint8                                         LootRarity;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_Skyfire_SkyfireSetLootRarityEarned;

// Function SkyfireRuntime.FortCheatManager_Skyfire.SkyfireSetLootRoomTime
// 0x0008 (0x0008 - 0x0000)
struct FortCheatManager_Skyfire_SkyfireSetLootRoomTime final
{
public:
	EFortRarity                                   LootRoomRarity;                                    // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeInSeconds;                                     // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_Skyfire_SkyfireSetLootRoomTime;

// Function SkyfireRuntime.FortCheatManager_Skyfire.SkyfireSetTimeBeforeLootRoomTeleport
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_Skyfire_SkyfireSetTimeBeforeLootRoomTeleport final
{
public:
	float                                         TimeInSeconds;                                     // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_Skyfire_SkyfireSetTimeBeforeLootRoomTeleport;

// Function SkyfireRuntime.SkyfireAudioManager.OnEnteringMainMap
// 0x0008 (0x0008 - 0x0000)
struct SkyfireAudioManager_OnEnteringMainMap final
{
public:
	const class AFortPlayerPawnAthena*            PlayerPawn;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkyfireAudioManager_OnEnteringMainMap;

// Function SkyfireRuntime.SkyfireAudioManager.OnExitingPlayspace
// 0x0001 (0x0001 - 0x0000)
struct SkyfireAudioManager_OnExitingPlayspace final
{
public:
	bool                                          bFromWarpTunnel;                                   // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkyfireAudioManager_OnExitingPlayspace;

// Function SkyfireRuntime.SkyfireAudioManager.OnPawnInMothershipChanged
// 0x0010 (0x0010 - 0x0000)
struct SkyfireAudioManager_OnPawnInMothershipChanged final
{
public:
	class AFortPlayerPawnAthena*                  PlayerPawn;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInMothership;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SkyfireAudioManager_OnPawnInMothershipChanged;

// Function SkyfireRuntime.SkyfireAudioManager.GetSkyfireMutator
// 0x0008 (0x0008 - 0x0000)
struct SkyfireAudioManager_GetSkyfireMutator final
{
public:
	class AFortAthenaMutator_Skyfire*             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkyfireAudioManager_GetSkyfireMutator;

// Function SkyfireRuntime.SkyfireBackpackComponent.CacheVariables
// 0x0010 (0x0010 - 0x0000)
struct SkyfireBackpackComponent_CacheVariables final
{
public:
	class AFortPlayerPawn*                        AssociatedPlayerPawn;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESkyfireBackpackComponentCachedExec           OutResult;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SkyfireBackpackComponent_CacheVariables;

// Function SkyfireRuntime.SkyfireBackpackComponent.Initialize
// 0x02B0 (0x02B0 - 0x0000)
struct SkyfireBackpackComponent_Initialize final
{
public:
	class ACustomCharacterPartModifier*           BackpackCCPM;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTimelineComponent*                     InCountUpTimeline;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSkyfireBackpackComponentInitializerAssetNamesStruct BackpackAssetNamesData;              // 0x0010(0x0078)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FSkyfireBackpackComponentInitializerColorsStruct BackpackColorData;                       // 0x0088(0x0044)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FSkyfireBackpackComponentInitializerConfigStruct BackpackConfigData;                      // 0x00CC(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSkyfireBackpackComponentInitializerFXStruct BackpackFXData;                              // 0x00F0(0x0070)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FSkyfireBackpackComponentInitializerTimesStruct BackpackTimesData;                        // 0x0160(0x001C)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSkyfireBackpackComponentInitializerSoundTickStruct BackpackSoundTickData;                // 0x0180(0x0070)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FSkyfireBackpackComponentInitializerSoundConfigStruct BackpackSoundConfigData;            // 0x01F0(0x0020)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FSkyfireBackpackComponentInitializerSoundRarityStruct BackpackSoundRarityData;            // 0x0210(0x0048)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FSkyfireBackpackComponentInitializerSoundTeleportStruct BackpackSoundTeleportData;        // 0x0258(0x0038)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const int32 SecondsRemaining)> InUpdateBackpackTickFunction;                      // 0x0290(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void()>                             InPlayCountUpTimeNative;                           // 0x02A0(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkyfireBackpackComponent_Initialize;

// Function SkyfireRuntime.SkyfireBackpackComponent.OnEarnedLootRarityChanged
// 0x0001 (0x0001 - 0x0000)
struct SkyfireBackpackComponent_OnEarnedLootRarityChanged final
{
public:
	EFortRarity                                   NewRarity;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkyfireBackpackComponent_OnEarnedLootRarityChanged;

// Function SkyfireRuntime.SkyfireBackpackComponent.OnExitInitialPrisonTimeChanged
// 0x0004 (0x0004 - 0x0000)
struct SkyfireBackpackComponent_OnExitInitialPrisonTimeChanged final
{
public:
	float                                         NewTime;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkyfireBackpackComponent_OnExitInitialPrisonTimeChanged;

// Function SkyfireRuntime.SkyfireBackpackComponent.OnExitLootRoomTimeChanged
// 0x0004 (0x0004 - 0x0000)
struct SkyfireBackpackComponent_OnExitLootRoomTimeChanged final
{
public:
	float                                         NewTime;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkyfireBackpackComponent_OnExitLootRoomTimeChanged;

// Function SkyfireRuntime.SkyfireBackpackComponent.OnPlayerEnteredLootRoom
// 0x0008 (0x0008 - 0x0000)
struct SkyfireBackpackComponent_OnPlayerEnteredLootRoom final
{
public:
	class USkyfirePlayerPawnComponent*            SkyfirePawnComponent;                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkyfireBackpackComponent_OnPlayerEnteredLootRoom;

// Function SkyfireRuntime.SkyfireBackpackComponent.OnTeleportToLootRoomTimeChanged
// 0x0004 (0x0004 - 0x0000)
struct SkyfireBackpackComponent_OnTeleportToLootRoomTimeChanged final
{
public:
	float                                         NewTime;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkyfireBackpackComponent_OnTeleportToLootRoomTimeChanged;

// Function SkyfireRuntime.SkyfireBackpackComponent.PawnLanded
// 0x0088 (0x0088 - 0x0000)
struct SkyfireBackpackComponent_PawnLanded final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkyfireBackpackComponent_PawnLanded;

// Function SkyfireRuntime.SkyfireBackpackComponent.ShouldTick
// 0x0001 (0x0001 - 0x0000)
struct SkyfireBackpackComponent_ShouldTick final
{
public:
	ESkyfireBackpackComponentYesNoExec            OutResult;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkyfireBackpackComponent_ShouldTick;

// Function SkyfireRuntime.SkyfireBackpackComponent.TimelineCountUpCompleted
// 0x0001 (0x0001 - 0x0000)
struct SkyfireBackpackComponent_TimelineCountUpCompleted final
{
public:
	ESkyfireBackpackComponentYesNoExec            OutResult;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkyfireBackpackComponent_TimelineCountUpCompleted;

// Function SkyfireRuntime.SkyfireBackpackComponent.TimelineCountUpTimeUpdate
// 0x0008 (0x0008 - 0x0000)
struct SkyfireBackpackComponent_TimelineCountUpTimeUpdate final
{
public:
	float                                         Alpha;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESkyfireBackpackComponentYesNoExec            OutResult;                                         // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SkyfireBackpackComponent_TimelineCountUpTimeUpdate;

// Function SkyfireRuntime.SkyfireBackpackComponent.GetSecondsUntil
// 0x0008 (0x0008 - 0x0000)
struct SkyfireBackpackComponent_GetSecondsUntil final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkyfireBackpackComponent_GetSecondsUntil;

// Function SkyfireRuntime.SkyfireBackpackComponent.GetSkyfireMutator
// 0x0008 (0x0008 - 0x0000)
struct SkyfireBackpackComponent_GetSkyfireMutator final
{
public:
	class AFortAthenaMutator_Skyfire*             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkyfireBackpackComponent_GetSkyfireMutator;

// Function SkyfireRuntime.SkyfirePlayerPawnComponent.ClientPlayerEnteringMainMap
// 0x0008 (0x0008 - 0x0000)
struct SkyfirePlayerPawnComponent_ClientPlayerEnteringMainMap final
{
public:
	const class AFortPlayerPawnAthena*            PlayerPawn;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkyfirePlayerPawnComponent_ClientPlayerEnteringMainMap;

// Function SkyfireRuntime.SkyfirePlayerPawnComponent.ClientPlayerExitingPlayspace
// 0x0001 (0x0001 - 0x0000)
struct SkyfirePlayerPawnComponent_ClientPlayerExitingPlayspace final
{
public:
	bool                                          bFromWarpTunnel;                                   // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkyfirePlayerPawnComponent_ClientPlayerExitingPlayspace;

// Function SkyfireRuntime.SkyfirePlayerPawnComponent.MarkPlayspaceActorOnClient
// 0x0010 (0x0010 - 0x0000)
struct SkyfirePlayerPawnComponent_MarkPlayspaceActorOnClient final
{
public:
	class AActor*                                 ActorToBeMarked;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseHoveredMarkerDetail;                           // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SkyfirePlayerPawnComponent_MarkPlayspaceActorOnClient;

// Function SkyfireRuntime.SkyfirePlayerPawnComponent.OnPlayerLootedContainer
// 0x0010 (0x0010 - 0x0000)
struct SkyfirePlayerPawnComponent_OnPlayerLootedContainer final
{
public:
	class AFortPlayerPawnAthena*                  FortPlayerPawnAthena;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ABuildingContainer*                     LootedContainer;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkyfirePlayerPawnComponent_OnPlayerLootedContainer;

// Function SkyfireRuntime.SkyfirePlayerPawnComponent.GetEarnedLootRarity
// 0x0001 (0x0001 - 0x0000)
struct SkyfirePlayerPawnComponent_GetEarnedLootRarity final
{
public:
	EFortRarity                                   ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkyfirePlayerPawnComponent_GetEarnedLootRarity;

// Function SkyfireRuntime.SkyfirePlayerPawnComponent.GetExitInitialPrisonTime
// 0x0004 (0x0004 - 0x0000)
struct SkyfirePlayerPawnComponent_GetExitInitialPrisonTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkyfirePlayerPawnComponent_GetExitInitialPrisonTime;

// Function SkyfireRuntime.SkyfirePlayerPawnComponent.GetExitLootRoomTime
// 0x0004 (0x0004 - 0x0000)
struct SkyfirePlayerPawnComponent_GetExitLootRoomTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkyfirePlayerPawnComponent_GetExitLootRoomTime;

// Function SkyfireRuntime.SkyfirePlayerPawnComponent.GetSecondsUntil
// 0x0008 (0x0008 - 0x0000)
struct SkyfirePlayerPawnComponent_GetSecondsUntil final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkyfirePlayerPawnComponent_GetSecondsUntil;

// Function SkyfireRuntime.SkyfirePlayerPawnComponent.GetTeleportToLootRoomTime
// 0x0004 (0x0004 - 0x0000)
struct SkyfirePlayerPawnComponent_GetTeleportToLootRoomTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkyfirePlayerPawnComponent_GetTeleportToLootRoomTime;

// Function SkyfireRuntime.SkyfirePlayerPawnComponent.GetTimeUntilTeleportToLootRoom
// 0x0004 (0x0004 - 0x0000)
struct SkyfirePlayerPawnComponent_GetTimeUntilTeleportToLootRoom final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkyfirePlayerPawnComponent_GetTimeUntilTeleportToLootRoom;

// Function SkyfireRuntime.SkyfirePlayerPawnComponent.IsInMothership
// 0x0001 (0x0001 - 0x0000)
struct SkyfirePlayerPawnComponent_IsInMothership final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkyfirePlayerPawnComponent_IsInMothership;

// Function SkyfireRuntime.SkyfireBotPlayerPawnComponent.OnSkyfirePhaseChanged
// 0x0001 (0x0001 - 0x0000)
struct SkyfireBotPlayerPawnComponent_OnSkyfirePhaseChanged final
{
public:
	ESkyfirePhase                                 NewPhase;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkyfireBotPlayerPawnComponent_OnSkyfirePhaseChanged;

// Function SkyfireRuntime.SkyfireControllerComponent.OnRep_SquadMemberStatusData
// 0x0010 (0x0010 - 0x0000)
struct SkyfireControllerComponent_OnRep_SquadMemberStatusData final
{
public:
	TArray<struct FSkyfireSquadMemberStatusData>  OldValues;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkyfireControllerComponent_OnRep_SquadMemberStatusData;

// Function SkyfireRuntime.SkyfireControllerComponent.OnViewTargetInMothershipChanged
// 0x0001 (0x0001 - 0x0000)
struct SkyfireControllerComponent_OnViewTargetInMothershipChanged final
{
public:
	bool                                          bInMothership;                                     // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkyfireControllerComponent_OnViewTargetInMothershipChanged;

// Function SkyfireRuntime.SkyfireTeleportSquadPoint.OnTeleportComplete
// 0x0008 (0x0008 - 0x0000)
struct SkyfireTeleportSquadPoint_OnTeleportComplete final
{
public:
	class AFortPlayerStateAthena*                 Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkyfireTeleportSquadPoint_OnTeleportComplete;

// Function SkyfireRuntime.SkyfireVaultOrbSpawner.BP_OrbSpawned
// 0x0008 (0x0008 - 0x0000)
struct SkyfireVaultOrbSpawner_BP_OrbSpawned final
{
public:
	class AActor*                                 SpawnedOrb;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkyfireVaultOrbSpawner_BP_OrbSpawned;

// Function SkyfireRuntime.SkyfireVaultOrbSpawner.HandleMutatorAttachedToGamestate
// 0x0008 (0x0008 - 0x0000)
struct SkyfireVaultOrbSpawner_HandleMutatorAttachedToGamestate final
{
public:
	class AFortGameplayMutator*                   AttachedMutator;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkyfireVaultOrbSpawner_HandleMutatorAttachedToGamestate;

// Function SkyfireRuntime.SkyfireVaultOrbSpawner.OnOrbPickedUp
// 0x0008 (0x0008 - 0x0000)
struct SkyfireVaultOrbSpawner_OnOrbPickedUp final
{
public:
	const class AActor*                           Orb;                                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkyfireVaultOrbSpawner_OnOrbPickedUp;

// Function SkyfireRuntime.SkyfireVaultOrbSpawner.OnSkyfirePhaseChanged
// 0x0001 (0x0001 - 0x0000)
struct SkyfireVaultOrbSpawner_OnSkyfirePhaseChanged final
{
public:
	ESkyfirePhase                                 NewPhase;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkyfireVaultOrbSpawner_OnSkyfirePhaseChanged;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
