#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialUMG

#include "Basic.hpp"

#include "CommonUILegacy_classes.hpp"
#include "UMG_classes.hpp"
#include "CommonUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SocialUMG_structs.hpp"
#include "Party_structs.hpp"
#include "Party_classes.hpp"


SDK_NAMESPACE_START

// Class SocialUMG.SocialChatContainer
// 0x0058 (0x02B8 - 0x0260)
class USocialChatContainer : public UUserWidget
{
public:
	class USocialChatManager*                     ChatManager;                                       // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class USocialChatChannel*>             JoinedChannels;                                    // 0x0268(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class USocialChatChannel*                     ActiveChannel;                                     // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonGroupLegacy*               TabButtonGroup;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_288[0x8];                                      // 0x0288(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USocialChatMessageList*                 ChatList_Messages;                                 // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USocialChatEditableText*                ChatEditableText_MessageEntry;                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonLegacy*                    Button_SendMessage;                                // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                       EntryBox_JoinedChannels;                           // 0x02A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScrollBox*                             ScrollBox_Channels;                                // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void DynamicHandleMessageTextCommitted(const class FText& MessageText, ETextCommit CommitMethod);
	void FocusEditableText();
	void HandleLeftTabPressed();
	void HandleRightTabPressed();
	void OnChatOpenChanged(bool bShouldBeOpen);
	void SendCurrentMessage();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialChatContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialChatContainer")
	}
	static class USocialChatContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatContainer>();
	}
};
DUMPER7_ASSERTS_USocialChatContainer;

// Class SocialUMG.SocialListEntryBase
// 0x0018 (0x0C38 - 0x0C20)
class USocialListEntryBase : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_C20[0x18];                                     // 0x0C20(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialListEntryBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialListEntryBase")
	}
	static class USocialListEntryBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialListEntryBase>();
	}
};
DUMPER7_ASSERTS_USocialListEntryBase;

// Class SocialUMG.SocialChatMessageEntry
// 0x0160 (0x03C0 - 0x0260)
class USocialChatMessageEntry : public UUserWidget
{
public:
	uint8                                         Pad_260[0x18];                                     // 0x0260(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSocialChatMessageEntryStyle           DefaultStyle;                                      // 0x0278(0x0138)(Edit, Protected, NativeAccessSpecifierProtected)
	class UCommonRichTextBlock*                   RichText_Message;                                  // 0x03B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UButton*                                Button_MessageButton;                              // 0x03B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnMessageSet();

	bool CanInteract() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialChatMessageEntry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialChatMessageEntry")
	}
	static class USocialChatMessageEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatMessageEntry>();
	}
};
DUMPER7_ASSERTS_USocialChatMessageEntry;

// Class SocialUMG.SocialUserListViewBase
// 0x00E8 (0x0308 - 0x0220)
class USocialUserListViewBase : public UListViewBase
{
public:
	uint8                                         Pad_220[0xE0];                                     // 0x0220(0x00E0)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EntrySpacing;                                      // 0x0300(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialUserListViewBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialUserListViewBase")
	}
	static class USocialUserListViewBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialUserListViewBase>();
	}
};
DUMPER7_ASSERTS_USocialUserListViewBase;

// Class SocialUMG.SocialChatChannelTab
// 0x0010 (0x0C30 - 0x0C20)
class USocialChatChannelTab : public UCommonButtonLegacy
{
public:
	class USocialChatChannel*                     ChatChannel;                                       // 0x0C20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       CommonText_ChannelName;                            // 0x0C28(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialChatChannelTab")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialChatChannelTab")
	}
	static class USocialChatChannelTab* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatChannelTab>();
	}
};
DUMPER7_ASSERTS_USocialChatChannelTab;

// Class SocialUMG.SocialChatEditableText
// 0x04F0 (0x05F8 - 0x0108)
class USocialChatEditableText final : public UWidget
{
public:
	uint8                                         Pad_108[0x20];                                     // 0x0108(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEditableTextStyle                     EditableTextStyle;                                 // 0x0128(0x0220)(Edit, NativeAccessSpecifierPrivate)
	struct FTextBlockStyle                        AutoCompleteStyle;                                 // 0x0348(0x0270)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5B8[0x40];                                     // 0x05B8(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialChatEditableText")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialChatEditableText")
	}
	static class USocialChatEditableText* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatEditableText>();
	}
};
DUMPER7_ASSERTS_USocialChatEditableText;

// Class SocialUMG.SocialChatMessageList
// 0x00F0 (0x0310 - 0x0220)
class USocialChatMessageList final : public UListViewBase
{
public:
	uint8                                         Pad_220[0xC0];                                     // 0x0220(0x00C0)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsFocusable;                                      // 0x02E0(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USocialChatChannel*                     ActiveChannel;                                     // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2F0[0x20];                                     // 0x02F0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialChatMessageList")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialChatMessageList")
	}
	static class USocialChatMessageList* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatMessageList>();
	}
};
DUMPER7_ASSERTS_USocialChatMessageList;

// Class SocialUMG.SocialGroupListEntry
// 0x0028 (0x0C48 - 0x0C20)
class USocialGroupListEntry final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_C20[0x8];                                      // 0x0C20(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class USocialActionMenu>          ActionMenuClass;                                   // 0x0C28(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialGroupChannel*                    SocialGroup;                                       // 0x0C30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             Text_GroupName;                                    // 0x0C38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMenuAnchor*                            MenuAnchor_Actions;                                // 0x0C40(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class UUserWidget* HandleGetMenuContent();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialGroupListEntry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialGroupListEntry")
	}
	static class USocialGroupListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialGroupListEntry>();
	}
};
DUMPER7_ASSERTS_USocialGroupListEntry;

// Class SocialUMG.SocialGroupTreeView
// 0x0020 (0x03E8 - 0x03C8)
class USocialGroupTreeView final : public UTreeView
{
public:
	TSubclassOf<class USocialGroupListEntry>      GroupEntryWidgetClass;                             // 0x03C8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class USocialListUserEntryBase>   UserEntryWidgetClass;                              // 0x03D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class USocialInteractionMenu>     ActionMenuClass;                                   // 0x03D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USocialInteractionMenu*                 ActionMenu;                                        // 0x03E0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialGroupTreeView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialGroupTreeView")
	}
	static class USocialGroupTreeView* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialGroupTreeView>();
	}
};
DUMPER7_ASSERTS_USocialGroupTreeView;

// Class SocialUMG.SocialInteractionButton
// 0x0060 (0x0C80 - 0x0C20)
class USocialInteractionButton : public UCommonButtonLegacy
{
public:
	struct FLinearColor                           DefaultIndicatorColor;                             // 0x0C20(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           AlertingIndicatorColor;                            // 0x0C30(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C40[0x30];                                     // 0x0C40(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_InteractionName;                              // 0x0C70(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBorder*                                Border_InteractionIndicator;                       // 0x0C78(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnInteractionSet();

	class FName GetInteractionName() const;
	bool IsPlatformOnlyFriend() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialInteractionButton")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialInteractionButton")
	}
	static class USocialInteractionButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialInteractionButton>();
	}
};
DUMPER7_ASSERTS_USocialInteractionButton;

// Class SocialUMG.SocialActionMenu
// 0x0038 (0x0370 - 0x0338)
class USocialActionMenu : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_338[0x38];                                     // 0x0338(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleMenuAnchorOpenChanged(bool bIsOpen);
	void OnOpened();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialActionMenu")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialActionMenu")
	}
	static class USocialActionMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialActionMenu>();
	}
};
DUMPER7_ASSERTS_USocialActionMenu;

// Class SocialUMG.SocialInteractionMenu
// 0x0068 (0x03D8 - 0x0370)
class USocialInteractionMenu : public USocialActionMenu
{
public:
	uint8                                         Pad_370[0x30];                                     // 0x0370(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UDynamicEntryBox*                       EntryBox_PositiveInteractions;                     // 0x03A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicEntryBox*                       EntryBox_NegativeInteractions;                     // 0x03A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USpacer*                                Spacer_InteractionSeparator;                       // 0x03B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonWidgetSwitcherLegacy*            Switcher_Confirmation;                             // 0x03B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             Text_ConfirmationLabel;                            // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonLegacy*                    Button_Confirm;                                    // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonLegacy*                    Button_Decline;                                    // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnToggleConfirmation(bool bIsVisible);

	class UWidget* GetFirstEntryToCenter() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialInteractionMenu")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialInteractionMenu")
	}
	static class USocialInteractionMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialInteractionMenu>();
	}
};
DUMPER7_ASSERTS_USocialInteractionMenu;

// Class SocialUMG.SocialNameTextBlock
// 0x0020 (0x06D0 - 0x06B0)
class USocialNameTextBlock : public UCommonRichTextBlock
{
public:
	class USocialUser*                            SocialUser;                                        // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinDesiredSize;                                    // 0x06B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxDesiredSize;                                    // 0x06BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowSecondName;                                   // 0x06C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EPlatformIconDisplayRule                      PlatformIconDisplayRule;                           // 0x06C1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bWrapToNextLine;                                   // 0x06C2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6C3[0x1];                                      // 0x06C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 SecondNameColor;                                   // 0x06C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SecondNameFontSize;                                // 0x06C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6CC[0x4];                                      // 0x06CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialNameTextBlock")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialNameTextBlock")
	}
	static class USocialNameTextBlock* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialNameTextBlock>();
	}
};
DUMPER7_ASSERTS_USocialNameTextBlock;

// Class SocialUMG.DesignerPreviewChatChannel
// 0x0068 (0x0150 - 0x00E8)
class UDesignerPreviewChatChannel final : public USocialChatChannel
{
public:
	uint8                                         Pad_E8[0x68];                                      // 0x00E8(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DesignerPreviewChatChannel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DesignerPreviewChatChannel")
	}
	static class UDesignerPreviewChatChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDesignerPreviewChatChannel>();
	}
};
DUMPER7_ASSERTS_UDesignerPreviewChatChannel;

// Class SocialUMG.SocialListInteractableEntryBase
// 0x0010 (0x0C48 - 0x0C38)
class USocialListInteractableEntryBase : public USocialListEntryBase
{
public:
	TSubclassOf<class USocialActionMenu>          ActionMenuClass;                                   // 0x0C38(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMenuAnchor*                            MenuAnchor_Actions;                                // 0x0C40(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class UUserWidget* HandleGetMenuContent();
	void HandleMenuOpenChanged(bool bIsMenuOpen);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialListInteractableEntryBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialListInteractableEntryBase")
	}
	static class USocialListInteractableEntryBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialListInteractableEntryBase>();
	}
};
DUMPER7_ASSERTS_USocialListInteractableEntryBase;

// Class SocialUMG.SocialListUserEntryBase
// 0x0018 (0x0C60 - 0x0C48)
class USocialListUserEntryBase : public USocialListInteractableEntryBase
{
public:
	uint8                                         Pad_C48[0x8];                                      // 0x0C48(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USocialNameTextBlock*                   Text_SocialName;                                   // 0x0C50(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRichTextBlock*                   Text_RichPresence;                                 // 0x0C58(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialListUserEntryBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialListUserEntryBase")
	}
	static class USocialListUserEntryBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialListUserEntryBase>();
	}
};
DUMPER7_ASSERTS_USocialListUserEntryBase;

// Class SocialUMG.SocialUserListHeaderEntry
// 0x0010 (0x0C48 - 0x0C38)
class USocialUserListHeaderEntry : public USocialListEntryBase
{
public:
	class UTextBlock*                             Text_ListName;                                     // 0x0C38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                             Text_NumEntries;                                   // 0x0C40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialUserListHeaderEntry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialUserListHeaderEntry")
	}
	static class USocialUserListHeaderEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialUserListHeaderEntry>();
	}
};
DUMPER7_ASSERTS_USocialUserListHeaderEntry;

// Class SocialUMG.SocialUserListView
// 0x0088 (0x0390 - 0x0308)
class USocialUserListView : public USocialUserListViewBase
{
public:
	uint8                                         Pad_308[0x30];                                     // 0x0308(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class USocialActionMenu*                      ActiveActionMenu;                                  // 0x0338(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<TSubclassOf<class USocialActionMenu>, class USocialActionMenu*> CachedActionMenuPool;       // 0x0340(0x0050)(ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialUserListView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialUserListView")
	}
	static class USocialUserListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialUserListView>();
	}
};
DUMPER7_ASSERTS_USocialUserListView;

// Class SocialUMG.SocialUserTreeView
// 0x00A0 (0x0430 - 0x0390)
class USocialUserTreeView : public USocialUserListView
{
public:
	uint8                                         Pad_390[0x70];                                     // 0x0390(0x0070)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class USocialListUserEntryBase>   UserEntryWidgetClass;                              // 0x0400(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class USocialListUserEntryBase>   InviteEntryWidgetClass;                            // 0x0408(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_410[0x20];                                     // 0x0410(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialUserTreeView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialUserTreeView")
	}
	static class USocialUserTreeView* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialUserTreeView>();
	}
};
DUMPER7_ASSERTS_USocialUserTreeView;

SDK_NAMESPACE_END
