#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ValetModsRuntime

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "ValetRuntime_structs.hpp"
#include "ValetModsRuntime_structs.hpp"
#include "CoreUObject_classes.hpp"


SDK_NAMESPACE_START

// Class ValetModsRuntime.FortGameStateComponent_ValetMods
// 0x0070 (0x0120 - 0x00B0)
class UFortGameStateComponent_ValetMods : public UFortGameStateComponent
{
public:
	TArray<TSubclassOf<class AFortValetModBase>>  AllMods;                                           // 0x00B0(0x0010)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FGameplayTag                           TiresTag;                                          // 0x00C0(0x0008)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxVehiclesCanSpawnWithMod;                        // 0x00C8(0x0028)(Edit, BlueprintVisible, Config, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         PercentChanceSpawnWithMod;                         // 0x00F0(0x0028)(Edit, BlueprintVisible, Config, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool TryInitValetMods();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortGameStateComponent_ValetMods")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortGameStateComponent_ValetMods")
	}
	static class UFortGameStateComponent_ValetMods* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameStateComponent_ValetMods>();
	}
};
DUMPER7_ASSERTS_UFortGameStateComponent_ValetMods;

// Class ValetModsRuntime.FortModInteractPoint
// 0x0030 (0x0250 - 0x0220)
class AFortModInteractPoint final : public AActor
{
public:
	uint8                                         Pad_220[0x8];                                      // 0x0220(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   InteractText;                                      // 0x0228(0x0018)(Net, Transient, Protected, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AFortValetModGarage>     ModGarage;                                         // 0x0240(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AFortValetModBase>       Mod;                                               // 0x0248(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortModInteractPoint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortModInteractPoint")
	}
	static class AFortModInteractPoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortModInteractPoint>();
	}
};
DUMPER7_ASSERTS_AFortModInteractPoint;

// Class ValetModsRuntime.FortValetModBase
// 0x0038 (0x0258 - 0x0220)
class AFortValetModBase : public AActor
{
public:
	struct FGameplayTagContainer                  ModTags;                                           // 0x0220(0x0020)(Edit, NativeAccessSpecifierPublic)
	class FText                                   InteractText;                                      // 0x0240(0x0018)(Edit, NativeAccessSpecifierPublic)

public:
	void OnModAppliedClient(class AFortDagwoodVehicle* ModdedVehicle);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortValetModBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortValetModBase")
	}
	static class AFortValetModBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortValetModBase>();
	}
};
DUMPER7_ASSERTS_AFortValetModBase;

// Class ValetModsRuntime.FortValetMod_Tire
// 0x01A0 (0x03F8 - 0x0258)
class AFortValetMod_Tire : public AFortValetModBase
{
public:
	struct FTireInfo                              TireData;                                          // 0x0258(0x01A0)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortValetMod_Tire")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortValetMod_Tire")
	}
	static class AFortValetMod_Tire* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortValetMod_Tire>();
	}
};
DUMPER7_ASSERTS_AFortValetMod_Tire;

// Class ValetModsRuntime.FortValetModGarage
// 0x0030 (0x0250 - 0x0220)
class AFortValetModGarage final : public AActor
{
public:
	class AFortDagwoodVehicle*                    CurrentVehicle;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class AFortModInteractPoint>      ModInteractPointClass;                             // 0x0228(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FModInteractCategory>           ModInteractCategories;                             // 0x0230(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class AFortModInteractPoint*>          SpawnedInteractPoints;                             // 0x0240(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	void OnVehicleEnter(class AFortDagwoodVehicle* NewVehicle);
	void OnVehicleExit(class AFortDagwoodVehicle* ExitingVehicle);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortValetModGarage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortValetModGarage")
	}
	static class AFortValetModGarage* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortValetModGarage>();
	}
};
DUMPER7_ASSERTS_AFortValetModGarage;

// Class ValetModsRuntime.FortVehicleModData
// 0x0000 (0x0028 - 0x0028)
class UFortVehicleModData final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortVehicleModData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortVehicleModData")
	}
	static class UFortVehicleModData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleModData>();
	}
};
DUMPER7_ASSERTS_UFortVehicleModData;

SDK_NAMESPACE_END
