#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Valet_BigRig_Vehicle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Valet_BasicCar_Vehicle_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass Valet_BigRig_Vehicle.Valet_BigRig_Vehicle_C
// 0x0090 (0x2930 - 0x28A0)
class AValet_BigRig_Vehicle_C final : public AValet_BasicCar_Vehicle_C
{
public:
	uint8                                         Pad_2894[0x4];                                     // 0x2894(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_Valet_BigRig_Vehicle_C;             // 0x2898(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               SmokeLeft_FX;                                      // 0x28A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               SmokeRight_FX;                                     // 0x28A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         HotfixScalePontoonTickRateFront_0;                 // 0x28B0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         HotfixScalePontoonTickRateRear_0;                  // 0x28D8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         MatIndex;                                          // 0x2900(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2904[0x4];                                     // 0x2904(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             SK_RandomMat0_Array_Occluded;                      // 0x2908(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsLocalPlayerPassenger;                            // 0x2918(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay)
	uint8                                         Pad_2919[0x7];                                     // 0x2919(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        PawnPassenger;                                     // 0x2920(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Valet_BigRig_Vehicle(int32 EntryPoint);
	void OnPawnExitVehicle(class AFortPlayerPawn* PlayerPawn, class FName ExitSocketName);
	void OnPawnEnterVehicle(class AFortPlayerPawn* PlayerPawn, const int32 SeatIdx);
	void OnEnteredWaterBody(class AFortWaterBodyActor* WaterBody_0);
	void UserConstructionScript();
	void LocalPassengerMatSwap();
	void PassengerEnter(class AFortPlayerPawn* PlayerPawn);
	void PassengerExit(class AFortPawn* PlayerPawn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Valet_BigRig_Vehicle_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Valet_BigRig_Vehicle_C")
	}
	static class AValet_BigRig_Vehicle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AValet_BigRig_Vehicle_C>();
	}
};
DUMPER7_ASSERTS_AValet_BigRig_Vehicle_C;

SDK_NAMESPACE_END
