#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VendettaUI

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "VendettaRuntime_structs.hpp"


SDK_NAMESPACE_START

// Class VendettaUI.VendettaWidgetBase
// 0x0008 (0x0328 - 0x0320)
class UVendettaWidgetBase : public ULTMWidgetBase
{
public:
	class AFortAthenaMutator_Vendetta*            CachedVendettaMutator;                             // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void BindToMutator_BP();
	void UnbindFromMutator_BP();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VendettaWidgetBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VendettaWidgetBase")
	}
	static class UVendettaWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVendettaWidgetBase>();
	}
};
DUMPER7_ASSERTS_UVendettaWidgetBase;

// Class VendettaUI.VendettaCreditsEarnedMessageWidget
// 0x0000 (0x0328 - 0x0328)
class UVendettaCreditsEarnedMessageWidget final : public UVendettaWidgetBase
{
public:
	void OnPlayerEliminatedBountyTarget(const class AFortPlayerStateAthena* VictimPlayerState, const class AFortPlayerStateAthena* KillerPlayerState, const class AFortPlayerStateAthena* NewTargetPlayerState, int32 VictimRewardValue, int32 VictimBonusValue);
	void OnPlayerEliminatedBountyTarget_BP(const class AFortPlayerStateAthena* VictimPlayerState, const class AFortPlayerStateAthena* KillerPlayerState, const class AFortPlayerStateAthena* NewTargetPlayerState, int32 VictimRewardValue, int32 VictimBonusValue);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VendettaCreditsEarnedMessageWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VendettaCreditsEarnedMessageWidget")
	}
	static class UVendettaCreditsEarnedMessageWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVendettaCreditsEarnedMessageWidget>();
	}
};
DUMPER7_ASSERTS_UVendettaCreditsEarnedMessageWidget;

// Class VendettaUI.VendettaSquadmateHuntedStatusWidget
// 0x0010 (0x0338 - 0x0328)
class UVendettaSquadmateHuntedStatusWidget final : public UVendettaWidgetBase
{
public:
	uint8                                         Pad_328[0x10];                                     // 0x0328(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPlayerHuntedStatusChanged(class AFortPlayerStateAthena* PlayerState, EVendettaHuntedStatus HuntedStatus, EVendettaHuntedStatus SpecialNPCHuntedStatus);
	void OnPlayerHuntedStatusChanged_BP(EVendettaHuntedStatus HuntedStatus, EVendettaHuntedStatus SpecialNPCHuntedStatus);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VendettaSquadmateHuntedStatusWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VendettaSquadmateHuntedStatusWidget")
	}
	static class UVendettaSquadmateHuntedStatusWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVendettaSquadmateHuntedStatusWidget>();
	}
};
DUMPER7_ASSERTS_UVendettaSquadmateHuntedStatusWidget;

// Class VendettaUI.VendettaTopMessagingWidgetBase
// 0x0048 (0x0310 - 0x02C8)
class UVendettaTopMessagingWidgetBase final : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_2C8[0x40];                                     // 0x02C8(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortPrioritizedWidgetData             PrioritizationData;                                // 0x0308(0x0002)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_30A[0x6];                                      // 0x030A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VendettaTopMessagingWidgetBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VendettaTopMessagingWidgetBase")
	}
	static class UVendettaTopMessagingWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVendettaTopMessagingWidgetBase>();
	}
};
DUMPER7_ASSERTS_UVendettaTopMessagingWidgetBase;

SDK_NAMESPACE_END
