#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VendettaRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "VendettaRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function VendettaRuntime.FortChargingSet_Vendetta_MarkTarget.OnRep_CurrentCharge
// 0x0028 (0x0028 - 0x0000)
struct FortChargingSet_Vendetta_MarkTarget_OnRep_CurrentCharge final
{
public:
	struct FFortGameplayAttributeData             OldValue;                                          // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortChargingSet_Vendetta_MarkTarget_OnRep_CurrentCharge;

// Function VendettaRuntime.FortCheatManager_Vendetta.VendettaSpawnCloserAI
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_Vendetta_VendettaSpawnCloserAI final
{
public:
	float                                         Distance;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_Vendetta_VendettaSpawnCloserAI;

// Function VendettaRuntime.FortCheatManager_Vendetta.VendettaSpawnMasterAI
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_Vendetta_VendettaSpawnMasterAI final
{
public:
	float                                         Distance;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_Vendetta_VendettaSpawnMasterAI;

// Function VendettaRuntime.FortCheatManager_Vendetta.VendettaSpawnSniperAI
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_Vendetta_VendettaSpawnSniperAI final
{
public:
	float                                         Distance;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_Vendetta_VendettaSpawnSniperAI;

// Function VendettaRuntime.FortCheatManager_Vendetta.VendettaSpawnTankAI
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_Vendetta_VendettaSpawnTankAI final
{
public:
	float                                         Distance;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_Vendetta_VendettaSpawnTankAI;

// Function VendettaRuntime.FortAthenaMutator_Vendetta.HandleHunterAISpawned
// 0x0018 (0x0018 - 0x0000)
struct FortAthenaMutator_Vendetta_HandleHunterAISpawned final
{
public:
	class APawn*                                  SpawnedAI;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UFortAthenaAISpawnerData*         SpawnerData;                                       // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UEQSActorSpawner*                 EQSActorSpawner;                                   // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Vendetta_HandleHunterAISpawned;

// Function VendettaRuntime.FortAthenaMutator_Vendetta.MulticastOnHuntersSpawned
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Vendetta_MulticastOnHuntersSpawned final
{
public:
	class FName                                   SpawnGroup;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Vendetta_MulticastOnHuntersSpawned;

// Function VendettaRuntime.FortAthenaMutator_Vendetta.MulticastOnMasterHunterDied
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Vendetta_MulticastOnMasterHunterDied final
{
public:
	class AFortPlayerStateAthena*                 MasterHuntersKiller;                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Vendetta_MulticastOnMasterHunterDied;

// Function VendettaRuntime.FortAthenaMutator_Vendetta.RegisterBountyPuckWeaponComponent
// 0x0018 (0x0018 - 0x0000)
struct FortAthenaMutator_Vendetta_RegisterBountyPuckWeaponComponent final
{
public:
	struct FGuid                                  TrackerGuid;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBountyPuckWeaponComponent*             BountyPuckWeaponComponent;                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Vendetta_RegisterBountyPuckWeaponComponent;

// Function VendettaRuntime.FortAthenaMutator_Vendetta.ShowUIMessageToAllClients
// 0x0018 (0x0018 - 0x0000)
struct FortAthenaMutator_Vendetta_ShowUIMessageToAllClients final
{
public:
	class FText                                   MessageText;                                       // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Vendetta_ShowUIMessageToAllClients;

// Function VendettaRuntime.FortAthenaMutator_Vendetta.UnregisterBountyPuckWeaponComponent
// 0x0018 (0x0018 - 0x0000)
struct FortAthenaMutator_Vendetta_UnregisterBountyPuckWeaponComponent final
{
public:
	struct FGuid                                  TrackerGuid;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBountyPuckWeaponComponent*             BountyPuckWeaponComponent;                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Vendetta_UnregisterBountyPuckWeaponComponent;

// Function VendettaRuntime.FortAthenaMutator_Vendetta.GetBountyPuckRarityForGuid
// 0x0014 (0x0014 - 0x0000)
struct FortAthenaMutator_Vendetta_GetBountyPuckRarityForGuid final
{
public:
	struct FGuid                                  BountyPuckTrackerGuid;                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortRarity                                   ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaMutator_Vendetta_GetBountyPuckRarityForGuid;

// Function VendettaRuntime.FortAthenaMutator_Vendetta.GetBountyPuckTargetDataCopyForGuid
// 0x0050 (0x0050 - 0x0000)
struct FortAthenaMutator_Vendetta_GetBountyPuckTargetDataCopyForGuid final
{
public:
	struct FGuid                                  BountyPuckTrackerGuid;                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVendettaBountyPuckTargetData          ReturnValue;                                       // 0x0010(0x0040)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Vendetta_GetBountyPuckTargetDataCopyForGuid;

// Function VendettaRuntime.FortAthenaMutator_Vendetta.HasMasterHunterSpawned
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_Vendetta_HasMasterHunterSpawned final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Vendetta_HasMasterHunterSpawned;

// Function VendettaRuntime.VendettaPlayerComponent.ClientOnBountyPuckReceivedByAlly
// 0x0018 (0x0018 - 0x0000)
struct VendettaPlayerComponent_ClientOnBountyPuckReceivedByAlly final
{
public:
	const class AFortPlayerStateAthena*           BountyPuckTargetPlayerState;                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AFortPlayerStateAthena*           ReceiverPlayerState;                               // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BonusRewardValue;                                  // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VendettaPlayerComponent_ClientOnBountyPuckReceivedByAlly;

// Function VendettaRuntime.VendettaPlayerComponent.ClientOnBountyPuckTargetDied
// 0x0020 (0x0020 - 0x0000)
struct VendettaPlayerComponent_ClientOnBountyPuckTargetDied final
{
public:
	const class AFortPlayerStateAthena*           VictimPlayerState;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AFortPlayerStateAthena*           KillerPlayerState;                                 // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AFortPlayerStateAthena*           NewTargetPlayerState;                              // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VictimRewardValue;                                 // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VictimBonusValue;                                  // 0x001C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VendettaPlayerComponent_ClientOnBountyPuckTargetDied;

// Function VendettaRuntime.VendettaPlayerComponent.ClientOnKilledNonTarget
// 0x0010 (0x0010 - 0x0000)
struct VendettaPlayerComponent_ClientOnKilledNonTarget final
{
public:
	const class AFortPlayerStateAthena*           VictimPlayerState;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VictimRewardValue;                                 // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VendettaPlayerComponent_ClientOnKilledNonTarget;

// Function VendettaRuntime.VendettaPlayerComponent.ClientPlayDeathMusic
// 0x0008 (0x0008 - 0x0000)
struct VendettaPlayerComponent_ClientPlayDeathMusic final
{
public:
	class USoundBase*                             DeathMusic;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VendettaPlayerComponent_ClientPlayDeathMusic;

// Function VendettaRuntime.VendettaPlayerComponent.HandleBountyPuckRarityChanged
// 0x0014 (0x0014 - 0x0000)
struct VendettaPlayerComponent_HandleBountyPuckRarityChanged final
{
public:
	struct FGuid                                  TrackerGuid;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortRarity                                   NewRarity;                                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VendettaPlayerComponent_HandleBountyPuckRarityChanged;

// Function VendettaRuntime.VendettaPlayerComponent.HandleClientLandedFromBus
// 0x0008 (0x0008 - 0x0000)
struct VendettaPlayerComponent_HandleClientLandedFromBus final
{
public:
	class AFortPlayerControllerZone*              PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VendettaPlayerComponent_HandleClientLandedFromBus;

// Function VendettaRuntime.VendettaPlayerComponent.HandleClientStartedRespawn
// 0x0008 (0x0008 - 0x0000)
struct VendettaPlayerComponent_HandleClientStartedRespawn final
{
public:
	class AFortPlayerControllerZone*              PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VendettaPlayerComponent_HandleClientStartedRespawn;

// Function VendettaRuntime.VendettaPlayerComponent.HandleCreditsPickedUp
// 0x0010 (0x0010 - 0x0000)
struct VendettaPlayerComponent_HandleCreditsPickedUp final
{
public:
	class AFortPlayerStateAthena*                 Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VendettaPlayerComponent_HandleCreditsPickedUp;

// Function VendettaRuntime.VendettaPlayerComponent.SetActiveBountyPuckGuid
// 0x0014 (0x0014 - 0x0000)
struct VendettaPlayerComponent_SetActiveBountyPuckGuid final
{
public:
	struct FGuid                                  InBountyPuckGuid;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreviousBountyWasCompleted;                       // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VendettaPlayerComponent_SetActiveBountyPuckGuid;

// Function VendettaRuntime.VendettaPlayerComponent.GetActiveBountyPuckGuid
// 0x0010 (0x0010 - 0x0000)
struct VendettaPlayerComponent_GetActiveBountyPuckGuid final
{
public:
	struct FGuid                                  ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VendettaPlayerComponent_GetActiveBountyPuckGuid;

// Function VendettaRuntime.VendettaPlayerComponent.GetActiveBountyPuckTarget
// 0x0008 (0x0008 - 0x0000)
struct VendettaPlayerComponent_GetActiveBountyPuckTarget final
{
public:
	class AFortPlayerStateAthena*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VendettaPlayerComponent_GetActiveBountyPuckTarget;

// Function VendettaRuntime.VendettaPlayerComponent.GetManagingMutator
// 0x0008 (0x0008 - 0x0000)
struct VendettaPlayerComponent_GetManagingMutator final
{
public:
	class AFortAthenaMutator_Vendetta*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VendettaPlayerComponent_GetManagingMutator;

// Function VendettaRuntime.VendettaPlayerComponent.GetMasterHunterCurrentTokens
// 0x0004 (0x0004 - 0x0000)
struct VendettaPlayerComponent_GetMasterHunterCurrentTokens final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VendettaPlayerComponent_GetMasterHunterCurrentTokens;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
